betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm_ex.h
/**
  *
  * @file    apm32f4xx_dal_rcm_ex.h
  * @brief   Header file of RCM DAL Extension module.
  *
  * @attention
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
  * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
  * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
  * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
  * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
  * OF THE POSSIBILITY OF SUCH DAMAGE.
  * The original code has been modified by Geehy Semiconductor.
  * Copyright (c) 2017 STMicroelectronics. Copyright (C) 2023-2025 Geehy Semiconductor.
  * All rights reserved.
  * This software is licensed under terms that can be found in the LICENSE file in
  * the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef APM32F4xx_DAL_RCM_EX_H
#define APM32F4xx_DAL_RCM_EX_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "apm32f4xx_dal_def.h"

/** @addtogroup APM32F4xx_DAL_Driver
  * @{
  */

/** @addtogroup RCMEx
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup RCMEx_Exported_Types RCMEx Exported Types
  * @{
  */

/**
  * @brief  RCM PLL configuration structure definition
  */
typedef struct
{
  uint32_t PLLState;   /*!< The new state of the PLL.
                            This parameter can be a value of @ref RCM_PLL_Config                      */

  uint32_t PLLSource;  /*!< RCM_PLLSource: PLL entry clock source.
                            This parameter must be a value of @ref RCM_PLL_Clock_Source               */

#if defined(APM32F403xx) || defined(APM32F402xx)
  uint32_t PLLMUL;        /*!< PLLMUL: Multiplication factor for PLL VCO input clock
                              This parameter must be a value of @ref RCMEx_PLL_Multiplication_Factor */
#else
  uint32_t PLLB;       /*!< PLLB: Division factor for PLL VCO input clock.
                            This parameter must be a number between Min_Data = 0 and Max_Data = 63    */

  uint32_t PLL1A;       /*!< PLL1A: Multiplication factor for PLL VCO output clock.
                            This parameter must be a number between Min_Data = 50 and Max_Data = 432
                            except for APM32F411xx devices where the Min_Data = 192 */

  uint32_t PLL1C;       /*!< PLL1C: Division factor for main system clock (SYSCLK).
                            This parameter must be a value of @ref RCM_PLL1C_Clock_Divider            */

  uint32_t PLLD;       /*!< PLLD: Division factor for OTG FS, SDIO and RNG clocks.
                            This parameter must be a number between Min_Data = 2 and Max_Data = 15    */
#endif /* APM32F403xx || APM32F402xx */
}RCM_PLLInitTypeDef;

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) ||\
    defined(APM32F465xx) || defined(APM32F411xx)
/**
  * @brief  PLLI2S Clock structure definition
  */
typedef struct
{
#if defined(APM32F411xx)
  uint32_t PLL2B;    /*!< PLLB: Division factor for PLLI2S VCO input clock.
                            This parameter must be a number between Min_Data = 2 and Max_Data = 62  */
#endif /* APM32F411xx */

  uint32_t PLL2A;    /*!< Specifies the multiplication factor for PLLI2S VCO output clock.
                            This parameter must be a number between Min_Data = 50 and Max_Data = 432
                            Except for APM32F411xx devices where the Min_Data = 192.
                            This parameter will be used only when PLLI2S is selected as Clock Source I2S or SAI */

  uint32_t PLL2C;    /*!< Specifies the division factor for I2S clock.
                            This parameter must be a number between Min_Data = 2 and Max_Data = 7.
                            This parameter will be used only when PLLI2S is selected as Clock Source I2S or SAI */

}RCM_PLLI2SInitTypeDef;

#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F411xx */
/**
  * @brief  RCM extended clocks structure definition
  */
typedef struct
{
  uint32_t PeriphClockSelection; /*!< The Extended Clock to be configured.
                                      This parameter can be a value of @ref RCMEx_Periph_Clock_Selection */
#if defined(APM32F407xx) || defined(APM32F417xx) || defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
  uint32_t SDRAMClockDivision;  /*!< The SDRAM clock division.
                                      This parameter can be a value of @ref RCMEx_SDRAM_Clock_Division */
#endif /* APM32F407xx || APM32F417xx || APM32F423xx || APM32F425xx || APM32F427xx */

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx)
  RCM_PLLI2SInitTypeDef PLLI2S;  /*!< PLL I2S structure parameters.
                                      This parameter will be used only when PLLI2S is selected as Clock Source I2S or SAI */
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx */

  uint32_t RTCClockSelection;      /*!< Specifies RTC Clock Prescalers Selection.
                                       This parameter can be a value of @ref RCM_RTC_Clock_Source */

#if defined(APM32F403xx) || defined(APM32F402xx)
  uint32_t AdcClockSelection;         /*!< ADC clock source
                                       This parameter can be a value of @ref RCMEx_ADC_Prescaler */

  uint32_t I2s2ClockSelection;         /*!< I2S2 clock source
                                       This parameter can be a value of @ref RCMEx_I2S2_Clock_Source */

  uint32_t UsbClockSelection;         /*!< USB clock source
                                       This parameter can be a value of @ref RCMEx_USB_Prescaler */
#endif /* APM32F403xx || APM32F402xx */

#if defined(APM32F411xx)
  uint8_t TMRPresSelection;        /*!< Specifies TMR Clock Source Selection.
                                      This parameter can be a value of @ref RCMEx_TMR_PRescaler_Selection */
#endif /* APM32F411xx */
}RCM_PeriphCLKInitTypeDef;
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RCMEx_Exported_Constants RCMEx Exported Constants
  * @{
  */

/** @defgroup RCMEx_Periph_Clock_Selection RCM Periph Clock Selection
  * @{
  */

/*-------- Peripheral Clock source for ---------------*/
#if defined(APM32F403xx) || defined(APM32F402xx)
#define RCM_PERIPHCLK_I2S2            0x00000001U
#elif defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || defined(APM32F411xx)
#define RCM_PERIPHCLK_I2S             0x00000001U
#endif /* APM32F403xx || APM32F402xx */
#define RCM_PERIPHCLK_RTC             0x00000002U
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx)
#define RCM_PERIPHCLK_PLLI2S          0x00000004U
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx */
#if defined(APM32F407xx) || defined(APM32F417xx) || defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define RCM_PERIPHCLK_SDRAM           0x00000008U
#endif /* APM32F407xx || APM32F417xx || APM32F423xx || APM32F425xx || APM32F427xx */
#if defined(APM32F411xx)
#define RCM_PERIPHCLK_TMR             0x00000008U
#endif /* APM32F411xx */
#if defined(APM32F403xx) || defined(APM32F402xx)
#define RCM_PERIPHCLK_ADC             0x00000008U
#define RCM_PERIPHCLK_USB             0x00000010U
#endif /* APM32F403xx || APM32F402xx */
/*----------------------------------------------------------------------------*/
/**
  * @}
  */

#if defined(APM32F403xx) || defined(APM32F402xx)

