betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm_ex.h
/** @defgroup RCMEx_ADC_Prescaler ADC Prescaler
  * @{
  */
#define RCM_ADCPCLK2_DIV2              RCM_CFG_ADCPSC_DIV2
#define RCM_ADCPCLK2_DIV4              RCM_CFG_ADCPSC_DIV4
#define RCM_ADCPCLK2_DIV6              RCM_CFG_ADCPSC_DIV6
#define RCM_ADCPCLK2_DIV8              RCM_CFG_ADCPSC_DIV8

/**
  * @}
  */
/** @defgroup RCMEx_I2S2_Clock_Source I2S2 Clock Source
  * @{
  */
#define RCM_I2S2CLKSOURCE_SYSCLK              0x00000000U

/**
  * @}
  */

/** @defgroup RCCEx_USB_Prescaler USB Prescaler
  * @{
  */
#define RCM_USBCLKSOURCE_PLL_DIV1_5       0x00000000U
#define RCM_USBCLKSOURCE_PLL              RCM_CFG_OTGFSPSC_0
#define RCM_USBCLKSOURCE_PLL_DIV2         RCM_CFG_OTGFSPSC_1
#define RCM_USBCLKSOURCE_PLL_DIV2_5       (RCM_CFG_OTGFSPSC_1 | RCM_CFG_OTGFSPSC_0)

/**
  * @}
  */

/** @defgroup RCMEx_Prediv1_Factor HSE Prediv1 Factor
  * @{
  */
#define RCM_HSE_PREDIV_DIV1              0x00000000U
#define RCM_HSE_PREDIV_DIV2              RCM_CFG_PLLHSEPSC

/**
  * @}
  */

/** @defgroup RCMEx_PLL_Clock_Source PLL Clock Source
  * @{
  */
#define RCM_PLLSOURCE_HSI_DIV2      0x00000000U            /*!< HSI clock divided by 2 selected as PLL entry clock source */
#define RCM_PLLSOURCE_HSE           RCM_CFG_PLLSRCSEL      /*!< HSE clock selected as PLL entry clock source              */

/**
  * @}
  */

/** @defgroup RCMEx_PLL_Multiplication_Factor PLL Multiplication Factor
  * @{
  */
#define RCM_PLL_MUL2               RCM_CFG_PLLMULCFG2
#define RCM_PLL_MUL3               RCM_CFG_PLLMULCFG3
#define RCM_PLL_MUL4               RCM_CFG_PLLMULCFG4
#define RCM_PLL_MUL5               RCM_CFG_PLLMULCFG5
#define RCM_PLL_MUL6               RCM_CFG_PLLMULCFG6
#define RCM_PLL_MUL7               RCM_CFG_PLLMULCFG7
#define RCM_PLL_MUL8               RCM_CFG_PLLMULCFG8
#define RCM_PLL_MUL9               RCM_CFG_PLLMULCFG9
#define RCM_PLL_MUL10              RCM_CFG_PLLMULCFG10
#define RCM_PLL_MUL11              RCM_CFG_PLLMULCFG11
#define RCM_PLL_MUL12              RCM_CFG_PLLMULCFG12
#define RCM_PLL_MUL13              RCM_CFG_PLLMULCFG13
#define RCM_PLL_MUL14              RCM_CFG_PLLMULCFG14
#define RCM_PLL_MUL15              RCM_CFG_PLLMULCFG15
#define RCM_PLL_MUL16              RCM_CFG_PLLMULCFG16
/**
  * @}
  */

#endif /* APM32F403xx || APM32F402xx */

#if defined(APM32F407xx) || defined(APM32F417xx) || defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
/** @defgroup RCMEx_SDRAM_Clock_Division SDRAM Clock Division
  * @{
  */
#define RCM_SDRAM_DIV_1                 0x00000000U
#define RCM_SDRAM_DIV_2                 0x00000001U
#define RCM_SDRAM_DIV_4                 0x00000002U

/**
  * @}
  */
#endif /* APM32F407xx || APM32F417xx || APM32F423xx || APM32F425xx || APM32F427xx */

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || \
    defined(APM32F465xx) || defined(APM32F411xx)
/** @defgroup RCMEx_I2S_Clock_Source I2S Clock Source
  * @{
  */
#define RCM_I2SCLKSOURCE_PLLI2S         0x00000000U
#define RCM_I2SCLKSOURCE_EXT            0x00000001U
/**
  * @}
  */
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F411xx */

#if defined(APM32F411xx)
/** @defgroup RCMEx_TMR_PRescaler_Selection  RCM TMR PRescaler Selection
  * @{
  */
#define RCM_TMRPRES_DESACTIVATED        ((uint8_t)0x00)
#define RCM_TMRPRES_ACTIVATED           ((uint8_t)0x01)
/**
  * @}
  */
#endif /* APM32F411xx */

#if defined(APM32F411xx)
/** @defgroup RCMEx_LSE_Dual_Mode_Selection  RCM LSE Dual Mode Selection
  * @{
  */
#define RCM_LSE_LOWPOWER_MODE           ((uint8_t)0x00)
#define RCM_LSE_HIGHDRIVE_MODE          ((uint8_t)0x01)
/**
  * @}
  */
#endif /* APM32F411xx */

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || \
    defined(APM32F465xx) || defined(APM32F411xx) || defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
/** @defgroup RCM_MCO2_Clock_Source MCO2 Clock Source
  * @{
  */
#define RCM_MCO2SOURCE_SYSCLK            0x00000000U
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || \
    defined(APM32F465xx) || defined(APM32F411xx)
#define RCM_MCO2SOURCE_PLLI2SCLK         RCM_CFG_MCO2SEL_0
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F411xx */
#define RCM_MCO2SOURCE_HSE               RCM_CFG_MCO2SEL_1
#define RCM_MCO2SOURCE_PLLCLK            RCM_CFG_MCO2SEL
/**
  * @}
  */
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx ||
          APM32F465xx || APM32F411xx || APM32F423xx || APM32F425xx || APM32F427xx */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup RCMEx_Exported_Macros RCMEx Exported Macros
  * @{
  */

/*----------------------------------- APM32F40xxx/APM32F41xxx/APM32F465xx/APM32F423xx/APM32F425xx/APM32F427xx-----------------*/
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
/** @defgroup RCMEx_AHB1_Clock_Enable_Disable AHB1 Peripheral Clock Enable Disable
  * @brief  Enables or disables the AHB1 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __DAL_RCM_BKPSRAM_CLK_ENABLE() do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_BKPSRAMEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_BKPSRAMEN);\
                                        UNUSED(tmpreg); \
                                        } while(0U)
#define __DAL_RCM_CCMDATARAMEN_CLK_ENABLE() do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_DRAMEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_DRAMEN);\
                                        UNUSED(tmpreg); \
                                        } while(0U)
#define __DAL_RCM_CRC_CLK_ENABLE()     do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_CRCEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_CRCEN);\
                                        UNUSED(tmpreg); \
                                        } while(0U)
#define __DAL_RCM_GPIOD_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_PDEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_PDEN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_GPIOE_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_PEEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_PEEN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx)
#define __DAL_RCM_GPIOI_CLK_ENABLE()   do { \
                                       __IO uint32_t tmpreg = 0x00U; \
                                       SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_PIEN);\
                                       /* Delay after an RCM peripheral clock enabling */ \
                                       tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_PIEN);\
                                       UNUSED(tmpreg); \
                                       } while(0U)
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx */
#define __DAL_RCM_GPIOF_CLK_ENABLE()   do { \
                                       __IO uint32_t tmpreg = 0x00U; \
                                       SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_PFEN);\
                                       /* Delay after an RCM peripheral clock enabling */ \
                                       tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_PFEN);\
                                       UNUSED(tmpreg); \
                                       } while(0U)
#define __DAL_RCM_GPIOG_CLK_ENABLE()   do { \
                                       __IO uint32_t tmpreg = 0x00U; \
                                       SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_PGEN);\
                                       /* Delay after an RCM peripheral clock enabling */ \
                                       tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_PGEN);\
                                       UNUSED(tmpreg); \
                                       } while(0U)

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx)
#define __DAL_RCM_USB_OTG_HS_CLK_ENABLE()   do { \
                                       __IO uint32_t tmpreg = 0x00U; \
                                       SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_OTGHS1EN);\
                                       /* Delay after an RCM peripheral clock enabling */ \
                                       tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_OTGHS1EN);\
                                       UNUSED(tmpreg); \
                                       } while(0U)
#define __DAL_RCM_USB_OTG_HS_ULPI_CLK_ENABLE()   do { \
                                       __IO uint32_t tmpreg = 0x00U; \
                                       SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_OTGHSULPIEN);\
                                       /* Delay after an RCM peripheral clock enabling */ \
                                       tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_OTGHSULPIEN);\
                                       UNUSED(tmpreg); \
                                       } while(0U)
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx */

