betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm_ex.h
#if defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RCM_USB_OTG_FS2_CLK_ENABLE()   do { \
                                       __IO uint32_t tmpreg = 0x00U; \
                                       SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_OTGFS2EN);\
                                       /* Delay after an RCM peripheral clock enabling */ \
                                       tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_OTGFS2EN);\
                                       UNUSED(tmpreg); \
                                       } while(0U)
#endif /* APM32F423xx || APM32F425xx || APM32F427xx */

#define __DAL_RCM_GPIOD_CLK_DISABLE()           (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_PDEN))
#define __DAL_RCM_GPIOE_CLK_DISABLE()           (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_PEEN))
#define __DAL_RCM_GPIOF_CLK_DISABLE()           (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_PFEN))
#define __DAL_RCM_GPIOG_CLK_DISABLE()           (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_PGEN))
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx)
#define __DAL_RCM_GPIOI_CLK_DISABLE()           (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_PIEN))
#define __DAL_RCM_USB_OTG_HS_CLK_DISABLE()      (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_OTGHS1EN))
#define __DAL_RCM_USB_OTG_HS_ULPI_CLK_DISABLE() (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_OTGHSULPIEN))
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx */
#if defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RCM_USB_OTG_FS2_CLK_DISABLE()     (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_OTGFS2EN))
#endif /* APM32F423xx || APM32F425xx || APM32F427xx */
#define __DAL_RCM_BKPSRAM_CLK_DISABLE()         (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_BKPSRAMEN))
#define __DAL_RCM_CCMDATARAMEN_CLK_DISABLE()    (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_DRAMEN))
#define __DAL_RCM_CRC_CLK_DISABLE()             (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_CRCEN))

#if defined(APM32F407xx) || defined(APM32F417xx) || defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
/**
  * @brief  Enable ETHERNET clock.
  */
#define __DAL_RCM_ETHMAC_CLK_ENABLE()  do { \
                                       __IO uint32_t tmpreg = 0x00U; \
                                       SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_ETHEN);\
                                       /* Delay after an RCM peripheral clock enabling */ \
                                       tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_ETHEN);\
                                       UNUSED(tmpreg); \
                                       } while(0U)
#define __DAL_RCM_ETHMACTX_CLK_ENABLE() do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_ETHTXEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_ETHTXEN);\
                                        UNUSED(tmpreg); \
                                        } while(0U)
#define __DAL_RCM_ETHMACRX_CLK_ENABLE() do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_ETHRXEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_ETHRXEN);\
                                        UNUSED(tmpreg); \
                                        } while(0U)
#define __DAL_RCM_ETHMACPTP_CLK_ENABLE() do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_ETHPTPEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_ETHPTPEN);\
                                        UNUSED(tmpreg); \
                                        } while(0U)
#define __DAL_RCM_ETH_CLK_ENABLE()      do {                            \
                                        __DAL_RCM_ETHMAC_CLK_ENABLE();      \
                                        __DAL_RCM_ETHMACTX_CLK_ENABLE();    \
                                        __DAL_RCM_ETHMACRX_CLK_ENABLE();    \
                                        } while(0U)

/**
  * @brief  Disable ETHERNET clock.
  */
#define __DAL_RCM_ETHMAC_CLK_DISABLE()    (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_ETHEN))
#define __DAL_RCM_ETHMACTX_CLK_DISABLE()  (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_ETHTXEN))
#define __DAL_RCM_ETHMACRX_CLK_DISABLE()  (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_ETHRXEN))
#define __DAL_RCM_ETHMACPTP_CLK_DISABLE() (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_ETHPTPEN))
#define __DAL_RCM_ETH_CLK_DISABLE()       do {                             \
                                           __DAL_RCM_ETHMACTX_CLK_DISABLE();    \
                                           __DAL_RCM_ETHMACRX_CLK_DISABLE();    \
                                           __DAL_RCM_ETHMAC_CLK_DISABLE();      \
                                          } while(0U)
#endif /* APM32F407xx || APM32F417xx || APM32F423xx || APM32F425xx || APM32F427xx */
/**
  * @}
  */

/** @defgroup RCMEx_AHB1_Peripheral_Clock_Enable_Disable_Status AHB1 Peripheral Clock Enable Disable Status
  * @brief  Get the enable or disable status of the AHB1 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __DAL_RCM_BKPSRAM_IS_CLK_ENABLED()          ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_BKPSRAMEN)) != RESET)
#define __DAL_RCM_CCMDATARAMEN_IS_CLK_ENABLED()     ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_DRAMEN)) != RESET)
#define __DAL_RCM_CRC_IS_CLK_ENABLED()              ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_CRCEN)) != RESET)
#define __DAL_RCM_GPIOD_IS_CLK_ENABLED()            ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_PDEN)) != RESET)
#define __DAL_RCM_GPIOE_IS_CLK_ENABLED()            ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_PEEN)) != RESET)
#define __DAL_RCM_GPIOF_IS_CLK_ENABLED()            ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_PFEN)) != RESET)
#define __DAL_RCM_GPIOG_IS_CLK_ENABLED()            ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_PGEN)) != RESET)
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx)
#define __DAL_RCM_GPIOI_IS_CLK_ENABLED()            ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_PIEN)) != RESET)
#define __DAL_RCM_USB_OTG_HS_IS_CLK_ENABLED()       ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_OTGHS1EN)) != RESET)
#define __DAL_RCM_USB_OTG_HS_ULPI_IS_CLK_ENABLED()  ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_OTGHSULPIEN)) != RESET)
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx */
#if defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RCM_USB_OTG_FS2_IS_CLK_ENABLED()      ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_OTGFS2EN)) != RESET)
#endif /* APM32F423xx || APM32F425xx || APM32F427xx */

