betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm_ex.h
#define __DAL_RCM_GPIOD_IS_CLK_DISABLED()           ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_PDEN)) == RESET)
#define __DAL_RCM_GPIOE_IS_CLK_DISABLED()           ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_PEEN)) == RESET)
#define __DAL_RCM_GPIOF_IS_CLK_DISABLED()           ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_PFEN)) == RESET)
#define __DAL_RCM_GPIOG_IS_CLK_DISABLED()           ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_PGEN)) == RESET)
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx)
#define __DAL_RCM_GPIOI_IS_CLK_DISABLED()           ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_PIEN)) == RESET)
#define __DAL_RCM_USB_OTG_HS_IS_CLK_DISABLED()      ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_OTGHS1EN)) == RESET)
#define __DAL_RCM_USB_OTG_HS_ULPI_IS_CLK_DISABLED() ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_OTGHSULPIEN))== RESET)
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx */
#define __DAL_RCM_BKPSRAM_IS_CLK_DISABLED()         ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_BKPSRAMEN)) == RESET)
#define __DAL_RCM_CCMDATARAMEN_IS_CLK_DISABLED()    ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_DRAMEN)) == RESET)
#define __DAL_RCM_CRC_IS_CLK_DISABLED()             ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_CRCEN)) == RESET)
#if defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RCM_USB_OTG_FS2_IS_CLK_DISABLED()     ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_OTGFS2EN)) == RESET)
#endif /* APM32F423xx || APM32F425xx || APM32F427xx */

#if defined(APM32F407xx) || defined(APM32F417xx) || defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
/**
  * @brief  Enable ETHERNET clock.
  */
#define __DAL_RCM_ETHMAC_IS_CLK_ENABLED()     ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_ETHEN)) != RESET)
#define __DAL_RCM_ETHMACTX_IS_CLK_ENABLED()   ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_ETHTXEN)) != RESET)
#define __DAL_RCM_ETHMACRX_IS_CLK_ENABLED()   ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_ETHRXEN)) != RESET)
#define __DAL_RCM_ETHMACPTP_IS_CLK_ENABLED()  ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_ETHPTPEN)) != RESET)
#define __DAL_RCM_ETH_IS_CLK_ENABLED()        (__DAL_RCM_ETHMAC_IS_CLK_ENABLED()   && \
                                               __DAL_RCM_ETHMACTX_IS_CLK_ENABLED() && \
                                               __DAL_RCM_ETHMACRX_IS_CLK_ENABLED())
/**
  * @brief  Disable ETHERNET clock.
  */
#define __DAL_RCM_ETHMAC_IS_CLK_DISABLED()    ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_ETHEN)) == RESET)
#define __DAL_RCM_ETHMACTX_IS_CLK_DISABLED()  ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_ETHTXEN)) == RESET)
#define __DAL_RCM_ETHMACRX_IS_CLK_DISABLED()  ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_ETHRXEN)) == RESET)
#define __DAL_RCM_ETHMACPTP_IS_CLK_DISABLED() ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_ETHPTPEN)) == RESET)
#define __DAL_RCM_ETH_IS_CLK_DISABLED()        (__DAL_RCM_ETHMAC_IS_CLK_DISABLED()   && \
                                                __DAL_RCM_ETHMACTX_IS_CLK_DISABLED() && \
                                                __DAL_RCM_ETHMACRX_IS_CLK_DISABLED())
#endif /* APM32F407xx || APM32F417xx || APM32F423xx || APM32F425xx || APM32F427xx */
/**
  * @}
  */

/** @defgroup RCMEx_AHB2_Clock_Enable_Disable AHB2 Peripheral Clock Enable Disable
  * @brief  Enable or disable the AHB2 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __DAL_RCM_USB_OTG_FS_CLK_ENABLE()  do {(RCM->AHB2CLKEN |= (RCM_AHB2CLKEN_OTGFSEN));\
                                               __DAL_RCM_SYSCFG_CLK_ENABLE();\
                                              }while(0U)

#define __DAL_RCM_USB_OTG_FS_CLK_DISABLE() (RCM->AHB2CLKEN &= ~(RCM_AHB2CLKEN_OTGFSEN))

#define __DAL_RCM_RNG_CLK_ENABLE()    do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB2CLKEN, RCM_AHB2CLKEN_RNGEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB2CLKEN, RCM_AHB2CLKEN_RNGEN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_RNG_CLK_DISABLE()   (RCM->AHB2CLKEN &= ~(RCM_AHB2CLKEN_RNGEN))

#if defined(APM32F407xx) || defined(APM32F417xx)
#define __DAL_RCM_DCI_CLK_ENABLE()   do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->AHB2CLKEN, RCM_AHB2CLKEN_DCIEN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->AHB2CLKEN, RCM_AHB2CLKEN_DCIEN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_DCI_CLK_DISABLE()  (RCM->AHB2CLKEN &= ~(RCM_AHB2CLKEN_DCIEN))
#endif /* APM32F407xx || APM32F417xx */

#if defined(APM32F415xx) || defined(APM32F417xx)
#define __DAL_RCM_CRYP_CLK_ENABLE()   do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->AHB2CLKEN, RCM_AHB2CLKEN_CRYPEN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->AHB2CLKEN, RCM_AHB2CLKEN_CRYPEN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_HASH_CLK_ENABLE()   do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->AHB2CLKEN, RCM_AHB2CLKEN_HASHEN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->AHB2CLKEN, RCM_AHB2CLKEN_HASHEN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_CRYP_CLK_DISABLE()  (RCM->AHB2CLKEN &= ~(RCM_AHB2CLKEN_CRYPEN))
#define __DAL_RCM_HASH_CLK_DISABLE()  (RCM->AHB2CLKEN &= ~(RCM_AHB2CLKEN_HASHEN))
#endif /* APM32F415xx || APM32F417xx */
/**
  * @}
  */


/** @defgroup RCMEx_AHB2_Peripheral_Clock_Enable_Disable_Status AHB2 Peripheral Clock Enable Disable Status
  * @brief  Get the enable or disable status of the AHB2 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __DAL_RCM_USB_OTG_FS_IS_CLK_ENABLED()  ((RCM->AHB2CLKEN & (RCM_AHB2CLKEN_OTGFSEN)) != RESET)
#define __DAL_RCM_USB_OTG_FS_IS_CLK_DISABLED() ((RCM->AHB2CLKEN & (RCM_AHB2CLKEN_OTGFSEN)) == RESET)

#define __DAL_RCM_RNG_IS_CLK_ENABLED()   ((RCM->AHB2CLKEN & (RCM_AHB2CLKEN_RNGEN)) != RESET)
#define __DAL_RCM_RNG_IS_CLK_DISABLED()  ((RCM->AHB2CLKEN & (RCM_AHB2CLKEN_RNGEN)) == RESET)

#if defined(APM32F407xx) || defined(APM32F417xx)
#define __DAL_RCM_DCI_IS_CLK_ENABLED()  ((RCM->AHB2CLKEN & (RCM_AHB2CLKEN_DCIEN)) != RESET)
#define __DAL_RCM_DCI_IS_CLK_DISABLED() ((RCM->AHB2CLKEN & (RCM_AHB2CLKEN_DCIEN)) == RESET)
#endif /* APM32F407xx || APM32F417xx */

#if defined(APM32F415xx) || defined(APM32F417xx)
#define __DAL_RCM_CRYP_IS_CLK_ENABLED()   ((RCM->AHB2CLKEN & (RCM_AHB2CLKEN_CRYPEN)) != RESET)
#define __DAL_RCM_HASH_IS_CLK_ENABLED()   ((RCM->AHB2CLKEN & (RCM_AHB2CLKEN_HASHEN)) != RESET)

#define __DAL_RCM_CRYP_IS_CLK_DISABLED()  ((RCM->AHB2CLKEN & (RCM_AHB2CLKEN_CRYPEN)) == RESET)
#define __DAL_RCM_HASH_IS_CLK_DISABLED()  ((RCM->AHB2CLKEN & (RCM_AHB2CLKEN_HASHEN)) == RESET)
#endif /* APM32F415xx || APM32F417xx */
/**
  * @}
  */

/** @defgroup RCMEx_AHB3_Clock_Enable_Disable AHB3 Peripheral Clock Enable Disable
  * @brief  Enables or disables the AHB3 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RCM_EMMC_CLK_ENABLE()   do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->AHB3CLKEN, RCM_AHB3CLKEN_EMMCEN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->AHB3CLKEN, RCM_AHB3CLKEN_EMMCEN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_EMMC_CLK_DISABLE() (RCM->AHB3CLKEN &= ~(RCM_AHB3CLKEN_EMMCEN))
#if defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RCM_QSPI_CLK_ENABLE()   do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->AHB3CLKEN, RCM_AHB3CLKEN_QSPIEN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->AHB3CLKEN, RCM_AHB3CLKEN_QSPIEN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_QSPI_CLK_DISABLE() (RCM->AHB3CLKEN &= ~(RCM_AHB3CLKEN_QSPIEN))
#endif /* APM32F423xx || APM32F425xx || APM32F427xx */
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
/**
  * @}
  */

/** @defgroup RCMEx_AHB3_Peripheral_Clock_Enable_Disable_Status AHB3 Peripheral Clock Enable Disable Status
  * @brief  Get the enable or disable status of the AHB3 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RCM_EMMC_IS_CLK_ENABLED()   ((RCM->AHB3CLKEN & (RCM_AHB3CLKEN_EMMCEN)) != RESET)
#define __DAL_RCM_EMMC_IS_CLK_DISABLED()  ((RCM->AHB3CLKEN & (RCM_AHB3CLKEN_EMMCEN)) == RESET)
#if defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RCM_QSPI_IS_CLK_ENABLED()   ((RCM->AHB3CLKEN & (RCM_AHB3CLKEN_QSPIEN)) != RESET)
#define __DAL_RCM_QSPI_IS_CLK_DISABLED()  ((RCM->AHB3CLKEN & (RCM_AHB3CLKEN_QSPIEN)) == RESET)
#endif /* APM32F423xx || APM32F425xx || APM32F427xx */
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
/**
  * @}
  */

/** @defgroup RCMEx_APB1_Clock_Enable_Disable APB1 Peripheral Clock Enable Disable
  * @brief  Enable or disable the Low Speed APB (APB1) peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __DAL_RCM_TMR6_CLK_ENABLE()   do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR6EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR6EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_TMR7_CLK_ENABLE()   do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR7EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR7EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_TMR12_CLK_ENABLE()  do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR12EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR12EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_TMR13_CLK_ENABLE()  do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR13EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR13EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_TMR14_CLK_ENABLE()  do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR14EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR14EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_USART3_CLK_ENABLE() do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_USART3EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_USART3EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_UART4_CLK_ENABLE()  do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_UART4EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_UART4EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_UART5_CLK_ENABLE()  do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_UART5EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_UART5EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_CAN1_CLK_ENABLE()   do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_CAN1EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_CAN1EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_CAN2_CLK_ENABLE()   do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_CAN2EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_CAN2EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_DAC_CLK_ENABLE()    do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_DACEN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_DACEN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_TMR2_CLK_ENABLE()     do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR2EN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR2EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_TMR3_CLK_ENABLE()     do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR3EN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR3EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_TMR4_CLK_ENABLE()     do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR4EN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR4EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_SPI3_CLK_ENABLE()     do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_SPI3EN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_SPI3EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_I2C3_CLK_ENABLE()     do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_I2C3EN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_I2C3EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_TMR2_CLK_DISABLE()   (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_TMR2EN))
#define __DAL_RCM_TMR3_CLK_DISABLE()   (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_TMR3EN))
#define __DAL_RCM_TMR4_CLK_DISABLE()   (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_TMR4EN))
#define __DAL_RCM_SPI3_CLK_DISABLE()   (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_SPI3EN))
#define __DAL_RCM_I2C3_CLK_DISABLE()   (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_I2C3EN))
#define __DAL_RCM_TMR6_CLK_DISABLE()   (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_TMR6EN))
#define __DAL_RCM_TMR7_CLK_DISABLE()   (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_TMR7EN))
#define __DAL_RCM_TMR12_CLK_DISABLE()  (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_TMR12EN))
#define __DAL_RCM_TMR13_CLK_DISABLE()  (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_TMR13EN))
#define __DAL_RCM_TMR14_CLK_DISABLE()  (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_TMR14EN))
#define __DAL_RCM_USART3_CLK_DISABLE() (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_USART3EN))
#define __DAL_RCM_UART4_CLK_DISABLE()  (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_UART4EN))
#define __DAL_RCM_UART5_CLK_DISABLE()  (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_UART5EN))
#define __DAL_RCM_CAN1_CLK_DISABLE()   (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_CAN1EN))
#define __DAL_RCM_CAN2_CLK_DISABLE()   (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_CAN2EN))
#define __DAL_RCM_DAC_CLK_DISABLE()    (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_DACEN))
/**
  * @}
  */

