betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm_ex.h
/** @defgroup RCMEx_APB1_Peripheral_Clock_Enable_Disable_Status APB1 Peripheral Clock Enable Disable Status
  * @brief  Get the enable or disable status of the APB1 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __DAL_RCM_TMR2_IS_CLK_ENABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR2EN)) != RESET)
#define __DAL_RCM_TMR3_IS_CLK_ENABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR3EN)) != RESET)
#define __DAL_RCM_TMR4_IS_CLK_ENABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR4EN)) != RESET)
#define __DAL_RCM_SPI3_IS_CLK_ENABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_SPI3EN)) != RESET)
#define __DAL_RCM_I2C3_IS_CLK_ENABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_I2C3EN)) != RESET)
#define __DAL_RCM_TMR6_IS_CLK_ENABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR6EN)) != RESET)
#define __DAL_RCM_TMR7_IS_CLK_ENABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR7EN)) != RESET)
#define __DAL_RCM_TMR12_IS_CLK_ENABLED()  ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR12EN)) != RESET)
#define __DAL_RCM_TMR13_IS_CLK_ENABLED()  ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR13EN)) != RESET)
#define __DAL_RCM_TMR14_IS_CLK_ENABLED()  ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR14EN)) != RESET)
#define __DAL_RCM_USART3_IS_CLK_ENABLED() ((RCM->APB1CLKEN & (RCM_APB1CLKEN_USART3EN)) != RESET)
#define __DAL_RCM_UART4_IS_CLK_ENABLED()  ((RCM->APB1CLKEN & (RCM_APB1CLKEN_UART4EN)) != RESET)
#define __DAL_RCM_UART5_IS_CLK_ENABLED()  ((RCM->APB1CLKEN & (RCM_APB1CLKEN_UART5EN)) != RESET)
#define __DAL_RCM_CAN1_IS_CLK_ENABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_CAN1EN)) != RESET)
#define __DAL_RCM_CAN2_IS_CLK_ENABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_CAN2EN)) != RESET)
#define __DAL_RCM_DAC_IS_CLK_ENABLED()    ((RCM->APB1CLKEN & (RCM_APB1CLKEN_DACEN)) != RESET)

#define __DAL_RCM_TMR2_IS_CLK_DISABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR2EN)) == RESET)
#define __DAL_RCM_TMR3_IS_CLK_DISABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR3EN)) == RESET)
#define __DAL_RCM_TMR4_IS_CLK_DISABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR4EN)) == RESET)
#define __DAL_RCM_SPI3_IS_CLK_DISABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_SPI3EN)) == RESET)
#define __DAL_RCM_I2C3_IS_CLK_DISABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_I2C3EN)) == RESET)
#define __DAL_RCM_TMR6_IS_CLK_DISABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR6EN)) == RESET)
#define __DAL_RCM_TMR7_IS_CLK_DISABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR7EN)) == RESET)
#define __DAL_RCM_TMR12_IS_CLK_DISABLED()  ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR12EN)) == RESET)
#define __DAL_RCM_TMR13_IS_CLK_DISABLED()  ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR13EN)) == RESET)
#define __DAL_RCM_TMR14_IS_CLK_DISABLED()  ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR14EN)) == RESET)
#define __DAL_RCM_USART3_IS_CLK_DISABLED() ((RCM->APB1CLKEN & (RCM_APB1CLKEN_USART3EN)) == RESET)
#define __DAL_RCM_UART4_IS_CLK_DISABLED()  ((RCM->APB1CLKEN & (RCM_APB1CLKEN_UART4EN)) == RESET)
#define __DAL_RCM_UART5_IS_CLK_DISABLED()  ((RCM->APB1CLKEN & (RCM_APB1CLKEN_UART5EN)) == RESET)
#define __DAL_RCM_CAN1_IS_CLK_DISABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_CAN1EN)) == RESET)
#define __DAL_RCM_CAN2_IS_CLK_DISABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_CAN2EN)) == RESET)
#define __DAL_RCM_DAC_IS_CLK_DISABLED()    ((RCM->APB1CLKEN & (RCM_APB1CLKEN_DACEN)) == RESET)
  /**
  * @}
  */

/** @defgroup RCMEx_APB2_Clock_Enable_Disable APB2 Peripheral Clock Enable Disable
  * @brief  Enable or disable the High Speed APB (APB2) peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __DAL_RCM_TMR8_CLK_ENABLE()   do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_TMR8EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_TMR8EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_ADC2_CLK_ENABLE()   do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_ADC2EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_ADC2EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_ADC3_CLK_ENABLE()   do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_ADC3EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_ADC3EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_SDIO_CLK_ENABLE()     do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_SDIOEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_SDIOEN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_TMR10_CLK_ENABLE()    do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_TMR10EN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_TMR10EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __DAL_RCM_SDIO_CLK_DISABLE()   (RCM->APB2CLKEN &= ~(RCM_APB2CLKEN_SDIOEN))
#define __DAL_RCM_TMR10_CLK_DISABLE()  (RCM->APB2CLKEN &= ~(RCM_APB2CLKEN_TMR10EN))
#define __DAL_RCM_TMR8_CLK_DISABLE()   (RCM->APB2CLKEN &= ~(RCM_APB2CLKEN_TMR8EN))
#define __DAL_RCM_ADC2_CLK_DISABLE()   (RCM->APB2CLKEN &= ~(RCM_APB2CLKEN_ADC2EN))
#define __DAL_RCM_ADC3_CLK_DISABLE()   (RCM->APB2CLKEN &= ~(RCM_APB2CLKEN_ADC3EN))
/**
  * @}
  */

/** @defgroup RCMEx_APB2_Peripheral_Clock_Enable_Disable_Status APB2 Peripheral Clock Enable Disable Status
  * @brief  Get the enable or disable status of the APB2 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __DAL_RCM_SDIO_IS_CLK_ENABLED()    ((RCM->APB2CLKEN & (RCM_APB2CLKEN_SDIOEN)) != RESET)
#define __DAL_RCM_TMR10_IS_CLK_ENABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_TMR10EN)) != RESET)
#define __DAL_RCM_TMR8_IS_CLK_ENABLED()    ((RCM->APB2CLKEN & (RCM_APB2CLKEN_TMR8EN)) != RESET)
#define __DAL_RCM_ADC2_IS_CLK_ENABLED()    ((RCM->APB2CLKEN & (RCM_APB2CLKEN_ADC2EN)) != RESET)
#define __DAL_RCM_ADC3_IS_CLK_ENABLED()    ((RCM->APB2CLKEN & (RCM_APB2CLKEN_ADC3EN)) != RESET)

#define __DAL_RCM_SDIO_IS_CLK_DISABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_SDIOEN)) == RESET)
#define __DAL_RCM_TMR10_IS_CLK_DISABLED()  ((RCM->APB2CLKEN & (RCM_APB2CLKEN_TMR10EN)) == RESET)
#define __DAL_RCM_TMR8_IS_CLK_DISABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_TMR8EN)) == RESET)
#define __DAL_RCM_ADC2_IS_CLK_DISABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_ADC2EN)) == RESET)
#define __DAL_RCM_ADC3_IS_CLK_DISABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_ADC3EN)) == RESET)
/**
  * @}
  */

/** @defgroup RCMEx_AHB1_Force_Release_Reset AHB1 Force Release Reset
  * @brief  Force or release AHB1 peripheral reset.
  * @{
  */
#define __DAL_RCM_GPIOD_FORCE_RESET()    (RCM->AHB1RST |= (RCM_AHB1RST_PDRST))
#define __DAL_RCM_GPIOE_FORCE_RESET()    (RCM->AHB1RST |= (RCM_AHB1RST_PERST))
#define __DAL_RCM_GPIOF_FORCE_RESET()    (RCM->AHB1RST |= (RCM_AHB1RST_PFRST))
#define __DAL_RCM_GPIOG_FORCE_RESET()    (RCM->AHB1RST |= (RCM_AHB1RST_PGRST))
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx)
#define __DAL_RCM_GPIOI_FORCE_RESET()    (RCM->AHB1RST |= (RCM_AHB1RST_PIRST))
#define __DAL_RCM_USB_OTG_HS_FORCE_RESET()    (RCM->AHB1RST |= (RCM_AHB1RST_OTGHS1RST))
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx */
#if defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RCM_USB_OTG_FS2_FORCE_RESET()    (RCM->AHB1RST |= (RCM_AHB1RST_OTGFS2RST))
#endif /* APM32F423xx || APM32F425xx || APM32F427xx */
#define __DAL_RCM_ETHMAC_FORCE_RESET()   (RCM->AHB1RST |= (RCM_AHB1RST_ETHRST))
#define __DAL_RCM_CRC_FORCE_RESET()     (RCM->AHB1RST |= (RCM_AHB1RST_CRCRST))

