betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm_ex.h
#define __DAL_RCM_GPIOD_RELEASE_RESET()  (RCM->AHB1RST &= ~(RCM_AHB1RST_PDRST))
#define __DAL_RCM_GPIOE_RELEASE_RESET()  (RCM->AHB1RST &= ~(RCM_AHB1RST_PERST))
#define __DAL_RCM_GPIOF_RELEASE_RESET()  (RCM->AHB1RST &= ~(RCM_AHB1RST_PFRST))
#define __DAL_RCM_GPIOG_RELEASE_RESET()  (RCM->AHB1RST &= ~(RCM_AHB1RST_PGRST))
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx)
#define __DAL_RCM_GPIOI_RELEASE_RESET()  (RCM->AHB1RST &= ~(RCM_AHB1RST_PIRST))
#define __DAL_RCM_USB_OTG_HS_RELEASE_RESET()  (RCM->AHB1RST &= ~(RCM_AHB1RST_OTGHS1RST))
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx */
#if defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RCM_USB_OTG_FS2_RELEASE_RESET()  (RCM->AHB1RST &= ~(RCM_AHB1RST_OTGFS2RST))
#endif /* APM32F423xx || APM32F425xx || APM32F427xx */
#define __DAL_RCM_ETHMAC_RELEASE_RESET() (RCM->AHB1RST &= ~(RCM_AHB1RST_ETHRST))
#define __DAL_RCM_CRC_RELEASE_RESET()    (RCM->AHB1RST &= ~(RCM_AHB1RST_CRCRST))
/**
  * @}
  */

/** @defgroup RCMEx_AHB2_Force_Release_Reset AHB2 Force Release Reset
  * @brief  Force or release AHB2 peripheral reset.
  * @{
  */
#define __DAL_RCM_AHB2_FORCE_RESET()         (RCM->AHB2RST = 0xFFFFFFFFU)
#define __DAL_RCM_AHB2_RELEASE_RESET()       (RCM->AHB2RST = 0x00U)

#if defined(APM32F407xx) || defined(APM32F417xx)
#define __DAL_RCM_DCI_FORCE_RESET()   (RCM->AHB2RST |= (RCM_AHB2RST_DCIRST))
#define __DAL_RCM_DCI_RELEASE_RESET() (RCM->AHB2RST &= ~(RCM_AHB2RST_DCIRST))
#endif /* APM32F407xx || APM32F417xx */

#if defined(APM32F415xx) || defined(APM32F417xx)
#define __DAL_RCM_CRYP_FORCE_RESET()   (RCM->AHB2RST |= (RCM_AHB2RST_CRYPRST))
#define __DAL_RCM_HASH_FORCE_RESET()   (RCM->AHB2RST |= (RCM_AHB2RST_HASHRST))

#define __DAL_RCM_CRYP_RELEASE_RESET() (RCM->AHB2RST &= ~(RCM_AHB2RST_CRYPRST))
#define __DAL_RCM_HASH_RELEASE_RESET() (RCM->AHB2RST &= ~(RCM_AHB2RST_HASHRST))
#endif /* APM32F415xx || APM32F417xx */

#define __DAL_RCM_USB_OTG_FS_FORCE_RESET()   (RCM->AHB2RST |= (RCM_AHB2RST_OTGFSRST))
#define __DAL_RCM_USB_OTG_FS_RELEASE_RESET() (RCM->AHB2RST &= ~(RCM_AHB2RST_OTGFSRST))

#define __DAL_RCM_RNG_FORCE_RESET()    (RCM->AHB2RST |= (RCM_AHB2RST_RNGRST))
#define __DAL_RCM_RNG_RELEASE_RESET()  (RCM->AHB2RST &= ~(RCM_AHB2RST_RNGRST))
/**
  * @}
  */

/** @defgroup RCMEx_AHB3_Force_Release_Reset AHB3 Force Release Reset
  * @brief  Force or release AHB3 peripheral reset.
  * @{
  */
#define __DAL_RCM_AHB3_FORCE_RESET() (RCM->AHB3RST = 0xFFFFFFFFU)
#define __DAL_RCM_AHB3_RELEASE_RESET() (RCM->AHB3RST = 0x00U)

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RCM_EMMC_FORCE_RESET()   (RCM->AHB3RST |= (RCM_AHB3RST_EMMCRST))
#define __DAL_RCM_EMMC_RELEASE_RESET() (RCM->AHB3RST &= ~(RCM_AHB3RST_EMMCRST))
#if defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RCM_QSPI_FORCE_RESET()   (RCM->AHB3RST |= (RCM_AHB3RST_QSPIRST))
#define __DAL_RCM_QSPI_RELEASE_RESET() (RCM->AHB3RST &= ~(RCM_AHB3RST_QSPIRST))
#endif /* APM32F423xx || APM32F425xx || APM32F427xx */
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

/**
  * @}
  */

/** @defgroup RCMEx_APB1_Force_Release_Reset APB1 Force Release Reset
  * @brief  Force or release APB1 peripheral reset.
  * @{
  */
#define __DAL_RCM_TMR6_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_TMR6RST))
#define __DAL_RCM_TMR7_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_TMR7RST))
#define __DAL_RCM_TMR12_FORCE_RESET()    (RCM->APB1RST |= (RCM_APB1RST_TMR12RST))
#define __DAL_RCM_TMR13_FORCE_RESET()    (RCM->APB1RST |= (RCM_APB1RST_TMR13RST))
#define __DAL_RCM_TMR14_FORCE_RESET()    (RCM->APB1RST |= (RCM_APB1RST_TMR14RST))
#define __DAL_RCM_USART3_FORCE_RESET()   (RCM->APB1RST |= (RCM_APB1RST_USART3RST))
#define __DAL_RCM_UART4_FORCE_RESET()    (RCM->APB1RST |= (RCM_APB1RST_UART4RST))
#define __DAL_RCM_UART5_FORCE_RESET()    (RCM->APB1RST |= (RCM_APB1RST_UART5RST))
#define __DAL_RCM_CAN1_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_CAN1RST))
#define __DAL_RCM_CAN2_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_CAN2RST))
#define __DAL_RCM_DAC_FORCE_RESET()      (RCM->APB1RST |= (RCM_APB1RST_DACRST))
#define __DAL_RCM_TMR2_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_TMR2RST))
#define __DAL_RCM_TMR3_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_TMR3RST))
#define __DAL_RCM_TMR4_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_TMR4RST))
#define __DAL_RCM_SPI3_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_SPI3RST))
#define __DAL_RCM_I2C3_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_I2C3RST))

#define __DAL_RCM_TMR2_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_TMR2RST))
#define __DAL_RCM_TMR3_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_TMR3RST))
#define __DAL_RCM_TMR4_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_TMR4RST))
#define __DAL_RCM_SPI3_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_SPI3RST))
#define __DAL_RCM_I2C3_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_I2C3RST))
#define __DAL_RCM_TMR6_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_TMR6RST))
#define __DAL_RCM_TMR7_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_TMR7RST))
#define __DAL_RCM_TMR12_RELEASE_RESET()  (RCM->APB1RST &= ~(RCM_APB1RST_TMR12RST))
#define __DAL_RCM_TMR13_RELEASE_RESET()  (RCM->APB1RST &= ~(RCM_APB1RST_TMR13RST))
#define __DAL_RCM_TMR14_RELEASE_RESET()  (RCM->APB1RST &= ~(RCM_APB1RST_TMR14RST))
#define __DAL_RCM_USART3_RELEASE_RESET() (RCM->APB1RST &= ~(RCM_APB1RST_USART3RST))
#define __DAL_RCM_UART4_RELEASE_RESET()  (RCM->APB1RST &= ~(RCM_APB1RST_UART4RST))
#define __DAL_RCM_UART5_RELEASE_RESET()  (RCM->APB1RST &= ~(RCM_APB1RST_UART5RST))
#define __DAL_RCM_CAN1_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_CAN1RST))
#define __DAL_RCM_CAN2_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_CAN2RST))
#define __DAL_RCM_DAC_RELEASE_RESET()    (RCM->APB1RST &= ~(RCM_APB1RST_DACRST))
/**
  * @}
  */

/** @defgroup RCMEx_APB2_Force_Release_Reset APB2 Force Release Reset
  * @brief  Force or release APB2 peripheral reset.
  * @{
  */
#define __DAL_RCM_TMR8_FORCE_RESET()   (RCM->APB2RST |= (RCM_APB2RST_TMR8RST))
#define __DAL_RCM_SDIO_FORCE_RESET()   (RCM->APB2RST |= (RCM_APB2RST_SDIORST))
#define __DAL_RCM_TMR10_FORCE_RESET()  (RCM->APB2RST |= (RCM_APB2RST_TMR10RST))

#define __DAL_RCM_SDIO_RELEASE_RESET() (RCM->APB2RST &= ~(RCM_APB2RST_SDIORST))
#define __DAL_RCM_TMR10_RELEASE_RESET()(RCM->APB2RST &= ~(RCM_APB2RST_TMR10RST))
#define __DAL_RCM_TMR8_RELEASE_RESET() (RCM->APB2RST &= ~(RCM_APB2RST_TMR8RST))
/**
  * @}
  */

