betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm_ex.h
/** @defgroup RCMEx_AHB1_LowPower_Enable_Disable AHB1 Peripheral Low Power Enable Disable
  * @brief  Enable or disable the AHB1 peripheral clock during Low Power (Sleep) mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */
#define __DAL_RCM_GPIOD_CLK_SLEEP_ENABLE()      (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_PDLPEN))
#define __DAL_RCM_GPIOE_CLK_SLEEP_ENABLE()      (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_PELPEN))
#define __DAL_RCM_GPIOF_CLK_SLEEP_ENABLE()      (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_PFLPEN))
#define __DAL_RCM_GPIOG_CLK_SLEEP_ENABLE()      (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_PGLPEN))
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx)
#define __DAL_RCM_GPIOI_CLK_SLEEP_ENABLE()      (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_PILPEN))
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx */
#define __DAL_RCM_SRAM2_CLK_SLEEP_ENABLE()      (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_SRAM2EN))
#if defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RCM_SRAM3_CLK_SLEEP_ENABLE()      (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_SRAM3EN))
#endif /* APM32F423xx || APM32F425xx || APM32F427xx */

#if defined(APM32F407xx) || defined(APM32F417xx) || defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RCM_ETHMAC_CLK_SLEEP_ENABLE()     (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_ETHEN))
#define __DAL_RCM_ETHMACTX_CLK_SLEEP_ENABLE()   (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_ETHTXEN))
#define __DAL_RCM_ETHMACRX_CLK_SLEEP_ENABLE()   (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_ETHRXEN))
#define __DAL_RCM_ETHMACPTP_CLK_SLEEP_ENABLE()  (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_ETHPTPEN))
#endif /* APM32F407xx || APM32F417xx || APM32F423xx || APM32F425xx || APM32F427xx */

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx)
#define __DAL_RCM_USB_OTG_HS_CLK_SLEEP_ENABLE()      (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_OTGHS1EN))
#define __DAL_RCM_USB_OTG_HS_ULPI_CLK_SLEEP_ENABLE()  (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_OTGHSULPIEN))
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx */
#if defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RCM_USB_OTG_FS2_CLK_SLEEP_ENABLE()      (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_OTGFS2EN))
#endif /* APM32F423xx || APM32F425xx || APM32F427xx */
#define __DAL_RCM_CRC_CLK_SLEEP_ENABLE()      (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_CRCLPEN))
#define __DAL_RCM_FLITF_CLK_SLEEP_ENABLE()    (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_FMCEN))
#define __DAL_RCM_SRAM1_CLK_SLEEP_ENABLE()    (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_SRAM1EN))
#define __DAL_RCM_BKPSRAM_CLK_SLEEP_ENABLE()  (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_BKPSRAMEN))

#define __DAL_RCM_GPIOD_CLK_SLEEP_DISABLE()     (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_PDLPEN))
#define __DAL_RCM_GPIOE_CLK_SLEEP_DISABLE()     (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_PELPEN))
#define __DAL_RCM_GPIOF_CLK_SLEEP_DISABLE()     (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_PFLPEN))
#define __DAL_RCM_GPIOG_CLK_SLEEP_DISABLE()     (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_PGLPEN))
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx)
#define __DAL_RCM_GPIOI_CLK_SLEEP_DISABLE()     (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_PILPEN))
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx */
#define __DAL_RCM_SRAM2_CLK_SLEEP_DISABLE()     (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_SRAM2EN))
#if defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RCM_SRAM3_CLK_SLEEP_DISABLE()     (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_SRAM3EN))
#endif /* APM32F423xx || APM32F425xx || APM32F427xx */

#if defined(APM32F407xx) || defined(APM32F417xx) || defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RCM_ETHMAC_CLK_SLEEP_DISABLE()    (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_ETHEN))
#define __DAL_RCM_ETHMACTX_CLK_SLEEP_DISABLE()  (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_ETHTXEN))
#define __DAL_RCM_ETHMACRX_CLK_SLEEP_DISABLE()  (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_ETHRXEN))
#define __DAL_RCM_ETHMACPTP_CLK_SLEEP_DISABLE() (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_ETHPTPEN))
#endif /* APM32F407xx || APM32F417xx || APM32F423xx || APM32F425xx || APM32F427xx */

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx)
#define __DAL_RCM_USB_OTG_HS_CLK_SLEEP_DISABLE()     (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_OTGHS1EN))
#define __DAL_RCM_USB_OTG_HS_ULPI_CLK_SLEEP_DISABLE() (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_OTGHSULPIEN))
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx */
#if defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RCM_USB_OTG_FS2_CLK_SLEEP_DISABLE()     (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_OTGFS2EN))
#endif /* APM32F423xx || APM32F425xx || APM32F427xx */
#define __DAL_RCM_CRC_CLK_SLEEP_DISABLE()       (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_CRCLPEN))
#define __DAL_RCM_FLITF_CLK_SLEEP_DISABLE()     (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_FMCEN))
#define __DAL_RCM_SRAM1_CLK_SLEEP_DISABLE()     (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_SRAM1EN))
#define __DAL_RCM_BKPSRAM_CLK_SLEEP_DISABLE()   (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_BKPSRAMEN))
/**
  * @}
  */

/** @defgroup RCMEx_AHB2_LowPower_Enable_Disable AHB2 Peripheral Low Power Enable Disable
  * @brief  Enable or disable the AHB2 peripheral clock during Low Power (Sleep) mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wake-up from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */
#define __DAL_RCM_USB_OTG_FS_CLK_SLEEP_ENABLE()  (RCM->LPAHB2CLKEN |= (RCM_LPAHB2CLKEN_OTGFSEN))
#define __DAL_RCM_USB_OTG_FS_CLK_SLEEP_DISABLE() (RCM->LPAHB2CLKEN &= ~(RCM_LPAHB2CLKEN_OTGFSEN))

#define __DAL_RCM_RNG_CLK_SLEEP_ENABLE()   (RCM->LPAHB2CLKEN |= (RCM_LPAHB2CLKEN_RNGEN))
#define __DAL_RCM_RNG_CLK_SLEEP_DISABLE()  (RCM->LPAHB2CLKEN &= ~(RCM_LPAHB2CLKEN_RNGEN))

#if defined(APM32F407xx) || defined(APM32F417xx)
#define __DAL_RCM_DCI_CLK_SLEEP_ENABLE()  (RCM->LPAHB2CLKEN |= (RCM_LPAHB2CLKEN_DCIEN))
#define __DAL_RCM_DCI_CLK_SLEEP_DISABLE() (RCM->LPAHB2CLKEN &= ~(RCM_LPAHB2CLKEN_DCIEN))
#endif /* APM32F407xx || APM32F417xx */

#if defined(APM32F415xx) || defined(APM32F417xx)
#define __DAL_RCM_CRYP_CLK_SLEEP_ENABLE()  (RCM->LPAHB2CLKEN |= (RCM_LPAHB2CLKEN_CRYPEN))
#define __DAL_RCM_HASH_CLK_SLEEP_ENABLE()  (RCM->LPAHB2CLKEN |= (RCM_LPAHB2CLKEN_HASHEN))

#define __DAL_RCM_CRYP_CLK_SLEEP_DISABLE() (RCM->LPAHB2CLKEN &= ~(RCM_LPAHB2CLKEN_CRYPEN))
#define __DAL_RCM_HASH_CLK_SLEEP_DISABLE() (RCM->LPAHB2CLKEN &= ~(RCM_LPAHB2CLKEN_HASHEN))
#endif /* APM32F415xx || APM32F417xx */
/**
  * @}
  */

/** @defgroup RCMEx_AHB3_LowPower_Enable_Disable AHB3 Peripheral Low Power Enable Disable
  * @brief  Enable or disable the AHB3 peripheral clock during Low Power (Sleep) mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RCM_EMMC_CLK_SLEEP_ENABLE()  (RCM->LPAHB3CLKEN |= (RCM_LPAHB3CLKEN_EMMCEN))
#define __DAL_RCM_EMMC_CLK_SLEEP_DISABLE() (RCM->LPAHB3CLKEN &= ~(RCM_LPAHB3CLKEN_EMMCEN))
#if defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define __DAL_RCM_QSPI_CLK_SLEEP_ENABLE()  (RCM->LPAHB3CLKEN |= (RCM_LPAHB3CLKEN_QSPIEN))
#define __DAL_RCM_QSPI_CLK_SLEEP_DISABLE() (RCM->LPAHB3CLKEN &= ~(RCM_LPAHB3CLKEN_QSPIEN))
#endif /* APM32F423xx || APM32F425xx || APM32F427xx */
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
/**
  * @}
  */

/** @defgroup RCMEx_APB1_LowPower_Enable_Disable APB1 Peripheral Low Power Enable Disable
  * @brief  Enable or disable the APB1 peripheral clock during Low Power (Sleep) mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */
#define __DAL_RCM_TMR6_CLK_SLEEP_ENABLE()    (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_TMR6EN))
#define __DAL_RCM_TMR7_CLK_SLEEP_ENABLE()    (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_TMR7EN))
#define __DAL_RCM_TMR12_CLK_SLEEP_ENABLE()   (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_TMR12EN))
#define __DAL_RCM_TMR13_CLK_SLEEP_ENABLE()   (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_TMR13EN))
#define __DAL_RCM_TMR14_CLK_SLEEP_ENABLE()   (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_TMR14EN))
#define __DAL_RCM_USART3_CLK_SLEEP_ENABLE()  (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_USART3EN))
#define __DAL_RCM_UART4_CLK_SLEEP_ENABLE()   (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_UART4EN))
#define __DAL_RCM_UART5_CLK_SLEEP_ENABLE()   (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_UART5EN))
#define __DAL_RCM_CAN1_CLK_SLEEP_ENABLE()    (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_CAN1EN))
#define __DAL_RCM_CAN2_CLK_SLEEP_ENABLE()    (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_CAN2EN))
#define __DAL_RCM_DAC_CLK_SLEEP_ENABLE()     (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_DACEN))
#define __DAL_RCM_TMR2_CLK_SLEEP_ENABLE()    (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_TMR2EN))
#define __DAL_RCM_TMR3_CLK_SLEEP_ENABLE()    (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_TMR3EN))
#define __DAL_RCM_TMR4_CLK_SLEEP_ENABLE()    (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_TMR4EN))
#define __DAL_RCM_SPI3_CLK_SLEEP_ENABLE()    (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_SPI3EN))
#define __DAL_RCM_I2C3_CLK_SLEEP_ENABLE()    (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_I2C3EN))

#define __DAL_RCM_TMR2_CLK_SLEEP_DISABLE()   (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_TMR2EN))
#define __DAL_RCM_TMR3_CLK_SLEEP_DISABLE()   (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_TMR3EN))
#define __DAL_RCM_TMR4_CLK_SLEEP_DISABLE()   (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_TMR4EN))
#define __DAL_RCM_SPI3_CLK_SLEEP_DISABLE()   (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_SPI3EN))
#define __DAL_RCM_I2C3_CLK_SLEEP_DISABLE()   (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_I2C3EN))
#define __DAL_RCM_TMR6_CLK_SLEEP_DISABLE()   (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_TMR6EN))
#define __DAL_RCM_TMR7_CLK_SLEEP_DISABLE()   (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_TMR7EN))
#define __DAL_RCM_TMR12_CLK_SLEEP_DISABLE()  (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_TMR12EN))
#define __DAL_RCM_TMR13_CLK_SLEEP_DISABLE()  (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_TMR13EN))
#define __DAL_RCM_TMR14_CLK_SLEEP_DISABLE()  (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_TMR14EN))
#define __DAL_RCM_USART3_CLK_SLEEP_DISABLE() (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_USART3EN))
#define __DAL_RCM_UART4_CLK_SLEEP_DISABLE()  (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_UART4EN))
#define __DAL_RCM_UART5_CLK_SLEEP_DISABLE()  (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_UART5EN))
#define __DAL_RCM_CAN1_CLK_SLEEP_DISABLE()   (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_CAN1EN))
#define __DAL_RCM_CAN2_CLK_SLEEP_DISABLE()   (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_CAN2EN))
#define __DAL_RCM_DAC_CLK_SLEEP_DISABLE()    (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_DACEN))
/**
  * @}
  */

/** @defgroup RCMEx_APB2_LowPower_Enable_Disable APB2 Peripheral Low Power Enable Disable
  * @brief  Enable or disable the APB2 peripheral clock during Low Power (Sleep) mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */
#define __DAL_RCM_TMR8_CLK_SLEEP_ENABLE() (RCM->LPAPB2CLKEN |= (RCM_LPAPB2CLKEN_TMR8EN))
#define __DAL_RCM_ADC2_CLK_SLEEP_ENABLE() (RCM->LPAPB2CLKEN |= (RCM_LPAPB2CLKEN_ADC2EN))
#define __DAL_RCM_ADC3_CLK_SLEEP_ENABLE() (RCM->LPAPB2CLKEN |= (RCM_LPAPB2CLKEN_ADC3EN))
#define __DAL_RCM_SDIO_CLK_SLEEP_ENABLE() (RCM->LPAPB2CLKEN |= (RCM_LPAPB2CLKEN_SDIOEN))
#define __DAL_RCM_TMR10_CLK_SLEEP_ENABLE()(RCM->LPAPB2CLKEN |= (RCM_LPAPB2CLKEN_TMR10EN))

#define __DAL_RCM_SDIO_CLK_SLEEP_DISABLE() (RCM->LPAPB2CLKEN &= ~(RCM_LPAPB2CLKEN_SDIOEN))
#define __DAL_RCM_TMR10_CLK_SLEEP_DISABLE()(RCM->LPAPB2CLKEN &= ~(RCM_LPAPB2CLKEN_TMR10EN))
#define __DAL_RCM_TMR8_CLK_SLEEP_DISABLE() (RCM->LPAPB2CLKEN &= ~(RCM_LPAPB2CLKEN_TMR8EN))
#define __DAL_RCM_ADC2_CLK_SLEEP_DISABLE() (RCM->LPAPB2CLKEN &= ~(RCM_LPAPB2CLKEN_ADC2EN))
#define __DAL_RCM_ADC3_CLK_SLEEP_DISABLE() (RCM->LPAPB2CLKEN &= ~(RCM_LPAPB2CLKEN_ADC3EN))
/**
  * @}
  */
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
/*----------------------------------------------------------------------------*/

/*-------------------------------- APM32F411xx -------------------------------*/
#if defined(APM32F411xx)
/** @defgroup RCMEx_AHB1_Clock_Enable_Disable AHB1 Peripheral Clock Enable Disable
  * @brief  Enables or disables the AHB1 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __DAL_RCM_GPIOD_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_PDEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_PDEN);\
                                        UNUSED(tmpreg); \
                                        } while(0U)
#define __DAL_RCM_GPIOE_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_PEEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_PEEN);\
                                        UNUSED(tmpreg); \
                                        } while(0U)
#define __DAL_RCM_CRC_CLK_ENABLE()     do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_CRCEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_CRCEN);\
                                        UNUSED(tmpreg); \
                                        } while(0U)
#define __DAL_RCM_GPIOD_CLK_DISABLE()           (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_PDEN))
#define __DAL_RCM_GPIOE_CLK_DISABLE()           (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_PEEN))
#define __DAL_RCM_CRC_CLK_DISABLE()             (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_CRCEN))
/**
  * @}
  */

/** @defgroup RCMEx_AHB1_Peripheral_Clock_Enable_Disable_Status AHB1 Peripheral Clock Enable Disable Status
  * @brief  Get the enable or disable status of the AHB1 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __DAL_RCM_GPIOD_IS_CLK_ENABLED()           ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_PDEN)) != RESET)
#define __DAL_RCM_GPIOE_IS_CLK_ENABLED()           ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_PEEN)) != RESET)
#define __DAL_RCM_CRC_IS_CLK_ENABLED()             ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_CRCEN)) != RESET)

