betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm_ex.h
#define __DAL_RCM_GPIOD_IS_CLK_DISABLED()           ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_PDEN)) == RESET)
#define __DAL_RCM_GPIOE_IS_CLK_DISABLED()           ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_PEEN)) == RESET)
#define __DAL_RCM_CRC_IS_CLK_DISABLED()             ((RCM->AHB1CLKEN & (RCM_AHB1CLKEN_CRCEN)) == RESET)
/**
  * @}
  */

/** @defgroup RCMEX_AHB2_Clock_Enable_Disable AHB2 Peripheral Clock Enable Disable
  * @brief  Enable or disable the AHB2 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __DAL_RCM_USB_OTG_FS_CLK_ENABLE()  do {(RCM->AHB2CLKEN |= (RCM_AHB2CLKEN_OTGFSEN));\
                                               __DAL_RCM_SYSCFG_CLK_ENABLE();\
                                              }while(0U)

#define __DAL_RCM_USB_OTG_FS_CLK_DISABLE() (RCM->AHB2CLKEN &= ~(RCM_AHB2CLKEN_OTGFSEN))

#define __DAL_RCM_RNG_CLK_ENABLE()    do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB2CLKEN, RCM_AHB2CLKEN_RNGEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB2CLKEN, RCM_AHB2CLKEN_RNGEN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_RNG_CLK_DISABLE()   (RCM->AHB2CLKEN &= ~(RCM_AHB2CLKEN_RNGEN))

#define __DAL_RCM_SMC_CLK_ENABLE()    do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB2CLKEN, RCM_AHB2CLKEN_SMCEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB2CLKEN, RCM_AHB2CLKEN_SMCEN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_SMC_CLK_DISABLE()   (RCM->AHB2CLKEN &= ~(RCM_AHB2CLKEN_SMCEN))

#define __DAL_RCM_QSPI_CLK_ENABLE()   do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB2CLKEN, RCM_AHB2CLKEN_QSPIEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB2CLKEN, RCM_AHB2CLKEN_QSPIEN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_QSPI_CLK_DISABLE()  (RCM->AHB2CLKEN &= ~(RCM_AHB2CLKEN_QSPIEN))
/**
  * @}
  */

/** @defgroup RCMEx_AHB2_Peripheral_Clock_Enable_Disable_Status AHB2 Peripheral Clock Enable Disable Status
  * @brief  Get the enable or disable status of the AHB2 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __DAL_RCM_USB_OTG_FS_IS_CLK_ENABLED()  ((RCM->AHB2CLKEN & (RCM_AHB2CLKEN_OTGFSEN)) != RESET)
#define __DAL_RCM_USB_OTG_FS_IS_CLK_DISABLED() ((RCM->AHB2CLKEN & (RCM_AHB2CLKEN_OTGFSEN)) == RESET)

#define __DAL_RCM_RNG_IS_CLK_ENABLED()         ((RCM->AHB2CLKEN & (RCM_AHB2CLKEN_RNGEN)) != RESET)
#define __DAL_RCM_RNG_IS_CLK_DISABLED()        ((RCM->AHB2CLKEN & (RCM_AHB2CLKEN_RNGEN)) == RESET)

#define __DAL_RCM_SMC_IS_CLK_ENABLED()         ((RCM->AHB2CLKEN & (RCM_AHB2CLKEN_SMCEN)) != RESET)
#define __DAL_RCM_SMC_IS_CLK_DISABLED()        ((RCM->AHB2CLKEN & (RCM_AHB2CLKEN_SMCEN)) == RESET)

#define __DAL_RCM_QSPI_IS_CLK_ENABLED()        ((RCM->AHB2CLKEN & (RCM_AHB2CLKEN_QSPIEN)) != RESET)
#define __DAL_RCM_QSPI_IS_CLK_DISABLED()       ((RCM->AHB2CLKEN & (RCM_AHB2CLKEN_QSPIEN)) == RESET)
/**
  * @}
  */

/** @defgroup RCMEx_APB1_Clock_Enable_Disable APB1 Peripheral Clock Enable Disable
  * @brief  Enable or disable the Low Speed APB (APB1) peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __DAL_RCM_TMR12_CLK_ENABLE()  do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR12EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR12EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_TMR13_CLK_ENABLE()  do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR13EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR13EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_TMR14_CLK_ENABLE()  do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR14EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR14EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_USART3_CLK_ENABLE() do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_USART3EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_USART3EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_UART4_CLK_ENABLE()  do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_UART4EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_UART4EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_UART5_CLK_ENABLE()  do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_UART5EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_UART5EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_CAN1_CLK_ENABLE()   do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_CAN1EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_CAN1EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_CAN2_CLK_ENABLE()   do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_CAN2EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_CAN2EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_TMR2_CLK_ENABLE()     do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR2EN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR2EN);\
                                        UNUSED(tmpreg); \
                                        } while(0U)
#define __DAL_RCM_TMR3_CLK_ENABLE()     do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR3EN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR3EN);\
                                        UNUSED(tmpreg); \
                                        } while(0U)
#define __DAL_RCM_TMR4_CLK_ENABLE()     do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR4EN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR4EN);\
                                        UNUSED(tmpreg); \
                                        } while(0U)
#define __DAL_RCM_SPI3_CLK_ENABLE()     do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_SPI3EN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_SPI3EN);\
                                        UNUSED(tmpreg); \
                                        } while(0U)
#define __DAL_RCM_I2C3_CLK_ENABLE()     do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_I2C3EN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_I2C3EN);\
                                        UNUSED(tmpreg); \
                                        } while(0U)

#define __DAL_RCM_TMR12_CLK_DISABLE()  (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_TMR12EN))
#define __DAL_RCM_TMR13_CLK_DISABLE()  (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_TMR13EN))
#define __DAL_RCM_TMR14_CLK_DISABLE()  (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_TMR14EN))
#define __DAL_RCM_USART3_CLK_DISABLE() (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_USART3EN))
#define __DAL_RCM_UART4_CLK_DISABLE()  (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_UART4EN))
#define __DAL_RCM_UART5_CLK_DISABLE()  (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_UART5EN))
#define __DAL_RCM_CAN1_CLK_DISABLE()   (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_CAN1EN))
#define __DAL_RCM_CAN2_CLK_DISABLE()   (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_CAN2EN))
#define __DAL_RCM_TMR2_CLK_DISABLE()   (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_TMR2EN))
#define __DAL_RCM_TMR3_CLK_DISABLE()   (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_TMR3EN))
#define __DAL_RCM_TMR4_CLK_DISABLE()   (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_TMR4EN))
#define __DAL_RCM_SPI3_CLK_DISABLE()   (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_SPI3EN))
#define __DAL_RCM_I2C3_CLK_DISABLE()   (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_I2C3EN))
/**
  * @}
  */

