betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm_ex.h
/** @defgroup RCMEx_APB1_Peripheral_Clock_Enable_Disable_Status APB1 Peripheral Clock Enable Disable Status
  * @brief  Get the enable or disable status of the APB1 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __DAL_RCM_TMR12_IS_CLK_ENABLED()  ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR12EN)) != RESET)
#define __DAL_RCM_TMR13_IS_CLK_ENABLED()  ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR13EN)) != RESET)
#define __DAL_RCM_TMR14_IS_CLK_ENABLED()  ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR14EN)) != RESET)
#define __DAL_RCM_USART3_IS_CLK_ENABLED() ((RCM->APB1CLKEN & (RCM_APB1CLKEN_USART3EN)) != RESET)
#define __DAL_RCM_UART4_IS_CLK_ENABLED()  ((RCM->APB1CLKEN & (RCM_APB1CLKEN_UART4EN)) != RESET)
#define __DAL_RCM_UART5_IS_CLK_ENABLED()  ((RCM->APB1CLKEN & (RCM_APB1CLKEN_UART5EN)) != RESET)
#define __DAL_RCM_CAN1_IS_CLK_ENABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_CAN1EN)) != RESET)
#define __DAL_RCM_CAN2_IS_CLK_ENABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_CAN2EN)) != RESET)
#define __DAL_RCM_TMR2_IS_CLK_ENABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR2EN)) != RESET)
#define __DAL_RCM_TMR3_IS_CLK_ENABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR3EN)) != RESET)
#define __DAL_RCM_TMR4_IS_CLK_ENABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR4EN)) != RESET)
#define __DAL_RCM_SPI3_IS_CLK_ENABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_SPI3EN)) != RESET)
#define __DAL_RCM_I2C3_IS_CLK_ENABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_I2C3EN)) != RESET)

#define __DAL_RCM_TMR12_IS_CLK_DISABLED()  ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR12EN)) == RESET)
#define __DAL_RCM_TMR13_IS_CLK_DISABLED()  ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR13EN)) == RESET)
#define __DAL_RCM_TMR14_IS_CLK_DISABLED()  ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR14EN)) == RESET)
#define __DAL_RCM_USART3_IS_CLK_DISABLED() ((RCM->APB1CLKEN & (RCM_APB1CLKEN_USART3EN)) == RESET)
#define __DAL_RCM_UART4_IS_CLK_DISABLED()  ((RCM->APB1CLKEN & (RCM_APB1CLKEN_UART4EN)) == RESET)
#define __DAL_RCM_UART5_IS_CLK_DISABLED()  ((RCM->APB1CLKEN & (RCM_APB1CLKEN_UART5EN)) == RESET)
#define __DAL_RCM_CAN1_IS_CLK_DISABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_CAN1EN)) == RESET)
#define __DAL_RCM_CAN2_IS_CLK_DISABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_CAN2EN)) == RESET)
#define __DAL_RCM_TMR2_IS_CLK_DISABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR2EN)) == RESET)
#define __DAL_RCM_TMR3_IS_CLK_DISABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR3EN)) == RESET)
#define __DAL_RCM_TMR4_IS_CLK_DISABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR4EN)) == RESET)
#define __DAL_RCM_SPI3_IS_CLK_DISABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_SPI3EN)) == RESET)
#define __DAL_RCM_I2C3_IS_CLK_DISABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_I2C3EN)) == RESET)
/**
  * @}
  */

/** @defgroup RCMEx_APB2_Clock_Enable_Disable APB2 Peripheral Clock Enable Disable
  * @brief  Enable or disable the High Speed APB (APB2) peripheral clock.
  * @{
  */
#define __DAL_RCM_TMR8_CLK_ENABLE()   do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_TMR8EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_TMR8EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_ADC2_CLK_ENABLE()   do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_ADC2EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_ADC2EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_SPI5_CLK_ENABLE()   do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_SPI5EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_SPI5EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_SDIO_CLK_ENABLE()     do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_SDIOEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_SDIOEN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_SPI4_CLK_ENABLE()     do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_SPI4EN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_SPI4EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_TMR10_CLK_ENABLE()    do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_TMR10EN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_TMR10EN);\
                                        UNUSED(tmpreg); \
                                      } while(0U)

#define __DAL_RCM_COMP1_CLK_ENABLE()    do { \
                                        __DAL_RCM_SYSCFG_CLK_ENABLE(); \
                                      } while(0U)
#define __DAL_RCM_COMP2_CLK_ENABLE()    do { \
                                        __DAL_RCM_SYSCFG_CLK_ENABLE(); \
                                      } while(0U)

#define __DAL_RCM_SDIO_CLK_DISABLE()   (RCM->APB2CLKEN &= ~(RCM_APB2CLKEN_SDIOEN))
#define __DAL_RCM_SPI4_CLK_DISABLE()   (RCM->APB2CLKEN &= ~(RCM_APB2CLKEN_SPI4EN))
#define __DAL_RCM_TMR10_CLK_DISABLE()  (RCM->APB2CLKEN &= ~(RCM_APB2CLKEN_TMR10EN))
#define __DAL_RCM_SPI5_CLK_DISABLE()   (RCM->APB2CLKEN &= ~(RCM_APB2CLKEN_SPI5EN))
#define __DAL_RCM_TMR8_CLK_DISABLE()   (RCM->APB2CLKEN &= ~(RCM_APB2CLKEN_TMR8EN))
#define __DAL_RCM_ADC2_CLK_DISABLE()   (RCM->APB2CLKEN &= ~(RCM_APB2CLKEN_ADC2EN))
#define __DAL_RCM_COMP1_CLK_DISABLE()  do { \
                                        __DAL_RCM_SYSCFG_CLK_DISABLE(); \
                                      } while(0U)
#define __DAL_RCM_COMP2_CLK_DISABLE()  do { \
                                        __DAL_RCM_SYSCFG_CLK_DISABLE(); \
                                      } while(0U)
/**
  * @}
  */

/** @defgroup RCMEx_APB2_Peripheral_Clock_Enable_Disable_Status APB2 Peripheral Clock Enable Disable Status
  * @brief  Get the enable or disable status of the APB2 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __DAL_RCM_SDIO_IS_CLK_ENABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_SDIOEN)) != RESET)
#define __DAL_RCM_SPI4_IS_CLK_ENABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_SPI4EN)) != RESET)
#define __DAL_RCM_TMR10_IS_CLK_ENABLED()  ((RCM->APB2CLKEN & (RCM_APB2CLKEN_TMR10EN)) != RESET)
#define __DAL_RCM_SPI5_IS_CLK_ENABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_SPI5EN)) != RESET)
#define __DAL_RCM_TMR8_IS_CLK_ENABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_TMR8EN)) != RESET)
#define __DAL_RCM_ADC2_IS_CLK_ENABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_ADC2EN)) != RESET)
#define __DAL_RCM_COMP1_IS_CLK_ENABLED()  do { \
                                           __DAL_RCM_SYSCFG_IS_CLK_ENABLED(); \
                                          } while(0U)
#define __DAL_RCM_COMP2_IS_CLK_ENABLED()  do { \
                                           __DAL_RCM_SYSCFG_IS_CLK_ENABLED(); \
                                          } while(0U)

#define __DAL_RCM_SDIO_IS_CLK_DISABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_SDIOEN)) == RESET)
#define __DAL_RCM_SPI4_IS_CLK_DISABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_SPI4EN)) == RESET)
#define __DAL_RCM_TMR10_IS_CLK_DISABLED()  ((RCM->APB2CLKEN & (RCM_APB2CLKEN_TMR10EN)) == RESET)
#define __DAL_RCM_SPI5_IS_CLK_DISABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_SPI5EN)) == RESET)
#define __DAL_RCM_TMR8_IS_CLK_DISABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_TMR8EN)) == RESET)
#define __DAL_RCM_ADC2_IS_CLK_DISABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_ADC2EN)) == RESET)
#define __DAL_RCM_COMP1_IS_CLK_DISABLED()  do { \
                                           __DAL_RCM_SYSCFG_IS_CLK_DISABLED(); \
                                          } while(0U)
#define __DAL_RCM_COMP2_IS_CLK_DISABLED()  do { \
                                           __DAL_RCM_SYSCFG_IS_CLK_DISABLED(); \
                                          } while(0U)
/**
  * @}
  */

/** @defgroup RCMEx_AHB1_Force_Release_Reset AHB1 Force Release Reset
  * @brief  Force or release AHB1 peripheral reset.
  * @{
  */
#define __DAL_RCM_GPIOD_FORCE_RESET()   (RCM->AHB1RST |= (RCM_AHB1RST_PDRST))
#define __DAL_RCM_GPIOE_FORCE_RESET()   (RCM->AHB1RST |= (RCM_AHB1RST_PERST))
#define __DAL_RCM_CRC_FORCE_RESET()     (RCM->AHB1RST |= (RCM_AHB1RST_CRCRST))

