betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm_ex.h
#define __DAL_RCM_GPIOD_RELEASE_RESET()  (RCM->AHB1RST &= ~(RCM_AHB1RST_PDRST))
#define __DAL_RCM_GPIOE_RELEASE_RESET()  (RCM->AHB1RST &= ~(RCM_AHB1RST_PERST))
#define __DAL_RCM_CRC_RELEASE_RESET()    (RCM->AHB1RST &= ~(RCM_AHB1RST_CRCRST))
/**
  * @}
  */

/** @defgroup RCMEx_AHB2_Force_Release_Reset AHB2 Force Release Reset
  * @brief  Force or release AHB2 peripheral reset.
  * @{
  */
#define __DAL_RCM_AHB2_FORCE_RESET()    (RCM->AHB2RST = 0xFFFFFFFFU)
#define __DAL_RCM_USB_OTG_FS_FORCE_RESET()   (RCM->AHB2RST |= (RCM_AHB2RST_OTGFSRST))

#define __DAL_RCM_AHB2_RELEASE_RESET()  (RCM->AHB2RST = 0x00U)
#define __DAL_RCM_USB_OTG_FS_RELEASE_RESET() (RCM->AHB2RST &= ~(RCM_AHB2RST_OTGFSRST))

#define __DAL_RCM_RNG_FORCE_RESET()     (RCM->AHB2RST |= (RCM_AHB2RST_RNGRST))
#define __DAL_RCM_RNG_RELEASE_RESET()   (RCM->AHB2RST &= ~(RCM_AHB2RST_RNGRST))

#define __DAL_RCM_SMC_FORCE_RESET()     (RCM->AHB2RST |= (RCM_AHB2RST_SMCRST))
#define __DAL_RCM_SMC_RELEASE_RESET()   (RCM->AHB2RST &= ~(RCM_AHB2RST_SMCRST))

#define __DAL_RCM_QSPI_FORCE_RESET()    (RCM->AHB2RST |= (RCM_AHB2RST_QSPIRST))
#define __DAL_RCM_QSPI_RELEASE_RESET()  (RCM->AHB2RST &= ~(RCM_AHB2RST_QSPIRST))
/**
  * @}
  */

/** @defgroup RCMEx_AHB3_Force_Release_Reset AHB3 Force Release Reset
  * @brief  Force or release AHB3 peripheral reset.
  * @{
  */
#define __DAL_RCM_AHB3_FORCE_RESET() (RCM->AHB3RST = 0xFFFFFFFFU)
#define __DAL_RCM_AHB3_RELEASE_RESET() (RCM->AHB3RST = 0x00U)
/**
  * @}
  */

/** @defgroup RCMEx_APB1_Force_Release_Reset APB1 Force Release Reset
  * @brief  Force or release APB1 peripheral reset.
  * @{
  */
#define __DAL_RCM_TMR2_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_TMR2RST))
#define __DAL_RCM_TMR3_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_TMR3RST))
#define __DAL_RCM_TMR4_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_TMR4RST))
#define __DAL_RCM_SPI3_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_SPI3RST))
#define __DAL_RCM_I2C3_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_I2C3RST))
#define __DAL_RCM_TMR12_FORCE_RESET()    (RCM->APB1RST |= (RCM_APB1RST_TMR12RST))
#define __DAL_RCM_TMR13_FORCE_RESET()    (RCM->APB1RST |= (RCM_APB1RST_TMR13RST))
#define __DAL_RCM_TMR14_FORCE_RESET()    (RCM->APB1RST |= (RCM_APB1RST_TMR14RST))
#define __DAL_RCM_USART3_FORCE_RESET()   (RCM->APB1RST |= (RCM_APB1RST_USART3RST))
#define __DAL_RCM_UART4_FORCE_RESET()    (RCM->APB1RST |= (RCM_APB1RST_UART4RST))
#define __DAL_RCM_UART5_FORCE_RESET()    (RCM->APB1RST |= (RCM_APB1RST_UART5RST))
#define __DAL_RCM_CAN1_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_CAN1RST))
#define __DAL_RCM_CAN2_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_CAN2RST))

#define __DAL_RCM_TMR2_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_TMR2RST))
#define __DAL_RCM_TMR3_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_TMR3RST))
#define __DAL_RCM_TMR4_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_TMR4RST))
#define __DAL_RCM_SPI3_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_SPI3RST))
#define __DAL_RCM_I2C3_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_I2C3RST))
#define __DAL_RCM_TMR12_RELEASE_RESET()  (RCM->APB1RST &= ~(RCM_APB1RST_TMR12RST))
#define __DAL_RCM_TMR13_RELEASE_RESET()  (RCM->APB1RST &= ~(RCM_APB1RST_TMR13RST))
#define __DAL_RCM_TMR14_RELEASE_RESET()  (RCM->APB1RST &= ~(RCM_APB1RST_TMR14RST))
#define __DAL_RCM_USART3_RELEASE_RESET() (RCM->APB1RST &= ~(RCM_APB1RST_USART3RST))
#define __DAL_RCM_UART4_RELEASE_RESET()  (RCM->APB1RST &= ~(RCM_APB1RST_UART4RST))
#define __DAL_RCM_UART5_RELEASE_RESET()  (RCM->APB1RST &= ~(RCM_APB1RST_UART5RST))
#define __DAL_RCM_CAN1_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_CAN1RST))
#define __DAL_RCM_CAN2_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_CAN2RST))
/**
  * @}
  */

/** @defgroup RCMEx_APB2_Force_Release_Reset APB2 Force Release Reset
  * @brief  Force or release APB2 peripheral reset.
  * @{
  */
#define __DAL_RCM_SPI5_FORCE_RESET()     (RCM->APB2RST |= (RCM_APB2RST_SPI5RST))
#define __DAL_RCM_SDIO_FORCE_RESET()     (RCM->APB2RST |= (RCM_APB2RST_SDIORST))
#define __DAL_RCM_SPI4_FORCE_RESET()     (RCM->APB2RST |= (RCM_APB2RST_SPI4RST))
#define __DAL_RCM_TMR10_FORCE_RESET()    (RCM->APB2RST |= (RCM_APB2RST_TMR10RST))
#define __DAL_RCM_TMR8_FORCE_RESET()     (RCM->APB2RST |= (RCM_APB2RST_TMR8RST))
#define __DAL_RCM_ADC2_FORCE_RESET()     (RCM->APB2RST |= (RCM_APB2RST_ADC2RST))

#define __DAL_RCM_SDIO_RELEASE_RESET()   (RCM->APB2RST &= ~(RCM_APB2RST_SDIORST))
#define __DAL_RCM_SPI4_RELEASE_RESET()   (RCM->APB2RST &= ~(RCM_APB2RST_SPI4RST))
#define __DAL_RCM_TMR10_RELEASE_RESET()  (RCM->APB2RST &= ~(RCM_APB2RST_TMR10RST))
#define __DAL_RCM_SPI5_RELEASE_RESET()   (RCM->APB2RST &= ~(RCM_APB2RST_SPI5RST))
#define __DAL_RCM_TMR8_RELEASE_RESET()   (RCM->APB2RST &= ~(RCM_APB2RST_TMR8RST))
#define __DAL_RCM_ADC2_RELEASE_RESET()   (RCM->APB2RST &= ~(RCM_APB2RST_ADC2RST))
/**
  * @}
  */

/** @defgroup RCMEx_AHB1_LowPower_Enable_Disable AHB1 Peripheral Low Power Enable Disable
  * @brief  Enable or disable the AHB1 peripheral clock during Low Power (Sleep) mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */
#define __DAL_RCM_GPIOD_CLK_SLEEP_ENABLE()    (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_PDLPEN))
#define __DAL_RCM_GPIOE_CLK_SLEEP_ENABLE()    (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_PELPEN))
#define __DAL_RCM_CRC_CLK_SLEEP_ENABLE()      (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_CRCLPEN))
#define __DAL_RCM_FLITF_CLK_SLEEP_ENABLE()    (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_FMCEN))
#define __DAL_RCM_SRAM1_CLK_SLEEP_ENABLE()    (RCM->LPAHB1CLKEN |= (RCM_LPAHB1CLKEN_SRAM1EN))

#define __DAL_RCM_GPIOD_CLK_SLEEP_DISABLE()   (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_PDLPEN))
#define __DAL_RCM_GPIOE_CLK_SLEEP_DISABLE()   (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_PELPEN))
#define __DAL_RCM_CRC_CLK_SLEEP_DISABLE()     (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_CRCLPEN))
#define __DAL_RCM_FLITF_CLK_SLEEP_DISABLE()   (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_FMCEN))
#define __DAL_RCM_SRAM1_CLK_SLEEP_DISABLE()   (RCM->LPAHB1CLKEN &= ~(RCM_LPAHB1CLKEN_SRAM1EN))
/**
  * @}
  */

/** @defgroup RCMEx_AHB2_LowPower_Enable_Disable AHB2 Peripheral Low Power Enable Disable
  * @brief  Enable or disable the AHB2 peripheral clock during Low Power (Sleep) mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wake-up from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */
#define __DAL_RCM_USB_OTG_FS_CLK_SLEEP_ENABLE()  (RCM->LPAHB2CLKEN |= (RCM_LPAHB2CLKEN_OTGFSEN))
#define __DAL_RCM_USB_OTG_FS_CLK_SLEEP_DISABLE()   (RCM->LPAHB2CLKEN &= ~(RCM_LPAHB2CLKEN_OTGFSEN))

#define __DAL_RCM_RNG_CLK_SLEEP_ENABLE()    (RCM->LPAHB2CLKEN |= (RCM_LPAHB2CLKEN_RNGEN))
#define __DAL_RCM_RNG_CLK_SLEEP_DISABLE()   (RCM->LPAHB2CLKEN &= ~(RCM_LPAHB2CLKEN_RNGEN))

#define __DAL_RCM_SMC_CLK_SLEEP_ENABLE()    (RCM->LPAHB2CLKEN |= (RCM_LPAHB2CLKEN_SMCEN))
#define __DAL_RCM_SMC_CLK_SLEEP_DISABLE()   (RCM->LPAHB2CLKEN &= ~(RCM_LPAHB2CLKEN_SMCEN))

#define __DAL_RCM_QSPI_CLK_SLEEP_ENABLE()   (RCM->LPAHB2CLKEN |= (RCM_LPAHB2CLKEN_QSPIEN))
#define __DAL_RCM_QSPI_CLK_SLEEP_DISABLE()  (RCM->LPAHB2CLKEN &= ~(RCM_LPAHB2CLKEN_QSPIEN))
/**
  * @}
  */

/** @defgroup RCMEx_APB1_LowPower_Enable_Disable APB1 Peripheral Low Power Enable Disable
  * @brief  Enable or disable the APB1 peripheral clock during Low Power (Sleep) mode.
  * @{
  */
#define __DAL_RCM_TMR2_CLK_SLEEP_ENABLE()    (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_TMR2EN))
#define __DAL_RCM_TMR3_CLK_SLEEP_ENABLE()    (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_TMR3EN))
#define __DAL_RCM_TMR4_CLK_SLEEP_ENABLE()    (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_TMR4EN))
#define __DAL_RCM_SPI3_CLK_SLEEP_ENABLE()    (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_SPI3EN))
#define __DAL_RCM_I2C3_CLK_SLEEP_ENABLE()    (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_I2C3EN))
#define __DAL_RCM_TMR12_CLK_SLEEP_ENABLE()   (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_TMR12EN))
#define __DAL_RCM_TMR13_CLK_SLEEP_ENABLE()   (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_TMR13EN))
#define __DAL_RCM_TMR14_CLK_SLEEP_ENABLE()   (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_TMR14EN))
#define __DAL_RCM_USART3_CLK_SLEEP_ENABLE()  (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_USART3EN))
#define __DAL_RCM_UART4_CLK_SLEEP_ENABLE()   (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_UART4EN))
#define __DAL_RCM_UART5_CLK_SLEEP_ENABLE()   (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_UART5EN))
#define __DAL_RCM_CAN1_CLK_SLEEP_ENABLE()    (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_CAN1EN))
#define __DAL_RCM_CAN2_CLK_SLEEP_ENABLE()    (RCM->LPAPB1CLKEN |= (RCM_LPAPB1CLKEN_CAN2EN))

#define __DAL_RCM_TMR2_CLK_SLEEP_DISABLE()   (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_TMR2EN))
#define __DAL_RCM_TMR3_CLK_SLEEP_DISABLE()   (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_TMR3EN))
#define __DAL_RCM_TMR4_CLK_SLEEP_DISABLE()   (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_TMR4EN))
#define __DAL_RCM_SPI3_CLK_SLEEP_DISABLE()   (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_SPI3EN))
#define __DAL_RCM_I2C3_CLK_SLEEP_DISABLE()   (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_I2C3EN))
#define __DAL_RCM_TMR12_CLK_SLEEP_DISABLE()  (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_TMR12EN))
#define __DAL_RCM_TMR13_CLK_SLEEP_DISABLE()  (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_TMR13EN))
#define __DAL_RCM_TMR14_CLK_SLEEP_DISABLE()  (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_TMR14EN))
#define __DAL_RCM_USART3_CLK_SLEEP_DISABLE() (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_USART3EN))
#define __DAL_RCM_UART4_CLK_SLEEP_DISABLE()  (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_UART4EN))
#define __DAL_RCM_UART5_CLK_SLEEP_DISABLE()  (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_UART5EN))
#define __DAL_RCM_CAN1_CLK_SLEEP_DISABLE()   (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_CAN1EN))
#define __DAL_RCM_CAN2_CLK_SLEEP_DISABLE()   (RCM->LPAPB1CLKEN &= ~(RCM_LPAPB1CLKEN_CAN2EN))
/**
  * @}
  */

/** @defgroup RCMEx_APB2_LowPower_Enable_Disable APB2 Peripheral Low Power Enable Disable
  * @brief  Enable or disable the APB2 peripheral clock during Low Power (Sleep) mode.
  * @{
  */
#define __DAL_RCM_SPI5_CLK_SLEEP_ENABLE()    (RCM->LPAPB2CLKEN |= (RCM_LPAPB2CLKEN_SPI5LPEN))
#define __DAL_RCM_SDIO_CLK_SLEEP_ENABLE()    (RCM->LPAPB2CLKEN |= (RCM_LPAPB2CLKEN_SDIOEN))
#define __DAL_RCM_SPI4_CLK_SLEEP_ENABLE()    (RCM->LPAPB2CLKEN |= (RCM_LPAPB2CLKEN_SPI4EN))
#define __DAL_RCM_TMR10_CLK_SLEEP_ENABLE()   (RCM->LPAPB2CLKEN |= (RCM_LPAPB2CLKEN_TMR10EN))
#define __DAL_RCM_TMR8_CLK_SLEEP_ENABLE()    (RCM->LPAPB2CLKEN |= (RCM_LPAPB2CLKEN_TMR8EN))
#define __DAL_RCM_ADC2_CLK_SLEEP_ENABLE()    (RCM->LPAPB2CLKEN |= (RCM_LPAPB2CLKEN_ADC2EN))

