betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm_ex.h
#define __DAL_RCM_SDIO_CLK_SLEEP_DISABLE()   (RCM->LPAPB2CLKEN &= ~(RCM_LPAPB2CLKEN_SDIOEN))
#define __DAL_RCM_SPI4_CLK_SLEEP_DISABLE()   (RCM->LPAPB2CLKEN &= ~(RCM_LPAPB2CLKEN_SPI4EN))
#define __DAL_RCM_TMR10_CLK_SLEEP_DISABLE()  (RCM->LPAPB2CLKEN &= ~(RCM_LPAPB2CLKEN_TMR10EN))
#define __DAL_RCM_SPI5_CLK_SLEEP_DISABLE()   (RCM->LPAPB2CLKEN &= ~(RCM_LPAPB2CLKEN_SPI5LPEN))
#define __DAL_RCM_TMR8_CLK_SLEEP_DISABLE()   (RCM->LPAPB2CLKEN &= ~(RCM_LPAPB2CLKEN_TMR8EN))
#define __DAL_RCM_ADC2_CLK_SLEEP_DISABLE()   (RCM->LPAPB2CLKEN &= ~(RCM_LPAPB2CLKEN_ADC2EN))
/**
  * @}
  */
#endif /* APM32F411xx */
/*----------------------------------------------------------------------------*/

/*-------------------------------- APM32F402/403xx -------------------------------*/
#if defined(APM32F403xx) || defined(APM32F402xx)
/** @defgroup RCMEx_AHB1_Clock_Enable_Disable AHB1 Peripheral Clock Enable Disable
  * @brief  Enables or disables the AHB1 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __DAL_RCM_SRAM_CLK_ENABLE()  do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_SRAMEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_SRAMEN);\
                                        UNUSED(tmpreg); \
                                         } while(0U)
#define __DAL_RCM_FMC_CLK_ENABLE()  do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_FMCEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_FMCEN);\
                                        UNUSED(tmpreg); \
                                         } while(0U)
#define __DAL_RCM_CRC_CLK_ENABLE()  do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_CRCEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_CRCEN);\
                                        UNUSED(tmpreg); \
                                         } while(0U)
#define __DAL_RCM_USB_OTG_FS_CLK_ENABLE()  do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_OTGFSEN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_OTGFSEN);\
                                        UNUSED(tmpreg); \
                                         } while(0U)
#define __DAL_RCM_DMA1_CLK_ENABLE()  do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_DMA1EN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_DMA1EN);\
                                        UNUSED(tmpreg); \
                                         } while(0U)
#define __DAL_RCM_DMA2_CLK_ENABLE()     do { \
                                        __IO uint32_t tmpreg = 0x00U; \
                                        SET_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_DMA2EN);\
                                        /* Delay after an RCM peripheral clock enabling */ \
                                        tmpreg = READ_BIT(RCM->AHB1CLKEN, RCM_AHB1CLKEN_DMA2EN);\
                                        UNUSED(tmpreg); \
                                          } while(0U)

#define __DAL_RCM_SRAM_CLK_DISABLE()         (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_SRAMEN))
#define __DAL_RCM_FMC_CLK_DISABLE()        (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_FMCEN))
#define __DAL_RCM_CRC_CLK_DISABLE()        (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_CRCEN))
#define __DAL_RCM_USB_OTG_FS_CLK_DISABLE()      (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_OTGFSEN))
#define __DAL_RCM_DMA1_CLK_DISABLE()         (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_DMA1EN))
#define __DAL_RCM_DMA2_CLK_DISABLE()         (RCM->AHB1CLKEN &= ~(RCM_AHB1CLKEN_DMA2EN))
/**
  * @}
  */

/** @defgroup RCMEx_AHB1_Peripheral_Clock_Enable_Disable_Status AHB1 Peripheral Clock Enable Disable Status
  * @brief  Get the enable or disable status of the AHB1 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __DAL_RCM_SRAM_IS_CLK_ENABLED()         ((RCM->AHB1CLKEN &(RCM_AHB1CLKEN_SRAMEN)) != RESET)
#define __DAL_RCM_FMC_IS_CLK_ENABLED()        ((RCM->AHB1CLKEN &(RCM_AHB1CLKEN_FMCEN)) != RESET)
#define __DAL_RCM_CRC_IS_CLK_ENABLED()        ((RCM->AHB1CLKEN &(RCM_AHB1CLKEN_CRCEN)) != RESET)
#define __DAL_RCM_USB_OTG_FS_IS_CLK_ENABLED()      ((RCM->AHB1CLKEN &(RCM_AHB1CLKEN_OTGFSEN)) != RESET)
#define __DAL_RCM_DMA1_IS_CLK_ENABLED()         ((RCM->AHB1CLKEN &(RCM_AHB1CLKEN_DMA1EN)) != RESET)
#define __DAL_RCM_DMA2_IS_CLK_ENABLED()         ((RCM->AHB1CLKEN &(RCM_AHB1CLKEN_DMA2EN)) != RESET)

#define __DAL_RCM_SRAM_IS_CLK_DISABLED()        ((RCM->AHB1CLKEN &(RCM_AHB1CLKEN_SRAMEN)) == RESET)
#define __DAL_RCM_FMC_IS_CLK_DISABLED()         ((RCM->AHB1CLKEN &(RCM_AHB1CLKEN_FMCEN)) == RESET)
#define __DAL_RCM_CRC_IS_CLK_DISABLED()         ((RCM->AHB1CLKEN &(RCM_AHB1CLKEN_CRCEN)) == RESET)
#define __DAL_RCM_USB_OTG_FS_IS_CLK_DISABLED()     ((RCM->AHB1CLKEN &(RCM_AHB1CLKEN_OTGFSEN)) == RESET)
#define __DAL_RCM_DMA1_IS_CLK_DISABLED()        ((RCM->AHB1CLKEN &(RCM_AHB1CLKEN_DMA1EN)) == RESET)
#define __DAL_RCM_DMA2_IS_CLK_DISABLED()        ((RCM->AHB1CLKEN &(RCM_AHB1CLKEN_DMA2EN)) == RESET)
/**
  * @}
  */

/** @defgroup RCMEx_APB1_Clock_Enable_Disable APB1 Peripheral Clock Enable Disable
  * @brief  Enable or disable the Low Speed APB (APB1) peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __DAL_RCM_TMR2_CLK_ENABLE()   do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR2EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR2EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_TMR3_CLK_ENABLE()   do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR3EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR3EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_TMR4_CLK_ENABLE()   do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR4EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_TMR4EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_USART3_CLK_ENABLE()  do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_USART3EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_USART3EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_UART4_CLK_ENABLE()  do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_UART4EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_UART4EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_CAN1_CLK_ENABLE()  do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_CAN1EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_CAN1EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_CAN2_CLK_ENABLE()  do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_CAN2EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_CAN2EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_BAKP_CLK_ENABLE()  do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_BAKPEN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB1CLKEN, RCM_APB1CLKEN_BAKPEN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)


#define __DAL_RCM_TMR2_CLK_DISABLE()      (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_TMR2EN))
#define __DAL_RCM_TMR3_CLK_DISABLE()      (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_TMR3EN))
#define __DAL_RCM_TMR4_CLK_DISABLE()      (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_TMR4EN))
#define __DAL_RCM_USART3_CLK_DISABLE()    (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_USART3EN))
#define __DAL_RCM_USRT4_CLK_DISABLE()     (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_USRT4EN))
#define __DAL_RCM_CAN1_CLK_DISABLE()      (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_CAN1EN))
#define __DAL_RCM_CAN2_CLK_DISABLE()      (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_CAN2EN))
#define __DAL_RCM_BAKP_CLK_DISABLE()      (RCM->APB1CLKEN &= ~(RCM_APB1CLKEN_BAKPEN))
/**
  * @}
  */

