betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm_ex.h
/** @defgroup RCMEx_APB1_Peripheral_Clock_Enable_Disable_Status APB1 Peripheral Clock Enable Disable Status
  * @brief  Get the enable or disable status of the APB1 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __DAL_RCM_TMR2_IS_CLK_ENABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR2EN)) != RESET)
#define __DAL_RCM_TMR3_IS_CLK_ENABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR3EN)) != RESET)
#define __DAL_RCM_TMR4_IS_CLK_ENABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR4EN)) != RESET)
#define __DAL_RCM_USART3_IS_CLK_ENABLED() ((RCM->APB1CLKEN & (RCM_APB1CLKEN_USART3EN)) != RESET)
#define __DAL_RCM_USRT4_IS_CLK_ENABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_USRT4EN)) != RESET)
#define __DAL_RCM_CAN1_IS_CLK_ENABLED()    ((RCM->APB1CLKEN & (RCM_APB1CLKEN_CAN1EN)) != RESET)
#define __DAL_RCM_CAN2_IS_CLK_ENABLED()    ((RCM->APB1CLKEN & (RCM_APB1CLKEN_CAN2EN)) != RESET)
#define __DAL_RCM_BAKP_IS_CLK_ENABLED()    ((RCM->APB1CLKEN & (RCM_APB1CLKEN_BAKPEN)) != RESET)

#define __DAL_RCM_TMR2_IS_CLK_DISABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR2EN)) == RESET)
#define __DAL_RCM_TMR3_IS_CLK_DISABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR3EN)) == RESET)
#define __DAL_RCM_TMR4_IS_CLK_DISABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_TMR4EN)) == RESET)
#define __DAL_RCM_USART3_IS_CLK_DISABLED() ((RCM->APB1CLKEN & (RCM_APB1CLKEN_USART3EN)) == RESET)
#define __DAL_RCM_USRT4_IS_CLK_DISABLED()   ((RCM->APB1CLKEN & (RCM_APB1CLKEN_USRT4EN)) == RESET)
#define __DAL_RCM_CAN1_IS_CLK_DISABLED()    ((RCM->APB1CLKEN & (RCM_APB1CLKEN_CAN1EN)) == RESET)
#define __DAL_RCM_CAN2_IS_CLK_DISABLED()    ((RCM->APB1CLKEN & (RCM_APB1CLKEN_CAN2EN)) == RESET)
#define __DAL_RCM_BAKP_IS_CLK_DISABLED()    ((RCM->APB1CLKEN & (RCM_APB1CLKEN_BAKPEN)) == RESET)
/**
  * @}
  */

/** @defgroup RCMEx_APB2_Clock_Enable_Disable APB2 Peripheral Clock Enable Disable
  * @brief  Enable or disable the High Speed APB (APB2) peripheral clock.
  * @{
  */
#define __DAL_RCM_AFIO_CLK_ENABLE()  do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_AFIOEN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_AFIOEN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_GPIOA_CLK_ENABLE()  do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_PAEN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_PAEN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_GPIOB_CLK_ENABLE()  do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_PBEN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_PBEN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_GPIOC_CLK_ENABLE()  do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_PCEN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_PCEN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_GPIOD_CLK_ENABLE()  do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_PDEN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_PDEN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_ADC2_CLK_ENABLE()  do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_ADC2EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_ADC2EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)
#define __DAL_RCM_TMR8_CLK_ENABLE()  do { \
                                      __IO uint32_t tmpreg = 0x00U; \
                                      SET_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_TMR8EN);\
                                      /* Delay after an RCM peripheral clock enabling */ \
                                      tmpreg = READ_BIT(RCM->APB2CLKEN, RCM_APB2CLKEN_TMR8EN);\
                                      UNUSED(tmpreg); \
                                      } while(0U)

#define __DAL_RCM_AFIO_CLK_DISABLE()    (RCM->APB2CLKEN &= ~(RCM_APB2CLKEN_AFIOEN))
#define __DAL_RCM_GPIOA_CLK_DISABLE()   (RCM->APB2CLKEN &= ~(RCM_APB2CLKEN_PAEN))
#define __DAL_RCM_GPIOB_CLK_DISABLE()   (RCM->APB2CLKEN &= ~(RCM_APB2CLKEN_PBEN))
#define __DAL_RCM_GPIOC_CLK_DISABLE()   (RCM->APB2CLKEN &= ~(RCM_APB2CLKEN_PCEN))
#define __DAL_RCM_GPIOD_CLK_DISABLE()   (RCM->APB2CLKEN &= ~(RCM_APB2CLKEN_PDEN))
#define __DAL_RCM_ADC2_CLK_DISABLE()    (RCM->APB2CLKEN &= ~(RCM_APB2CLKEN_ADC2EN))
#define __DAL_RCM_TMR8_CLK_DISABLE()    (RCM->APB2CLKEN &= ~(RCM_APB2CLKEN_TMR8EN))
/**
  * @}
  */

/** @defgroup RCMEx_APB2_Peripheral_Clock_Enable_Disable_Status APB2 Peripheral Clock Enable Disable Status
  * @brief  Get the enable or disable status of the APB2 peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __DAL_RCM_AFIO_IS_CLK_ENABLED()    ((RCM->APB2CLKEN & (RCM_APB2CLKEN_AFIOEN)) != RESET)
#define __DAL_RCM_GPIOA_IS_CLK_ENABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_PAEN)) != RESET)
#define __DAL_RCM_GPIOB_IS_CLK_ENABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_PBEN)) != RESET)
#define __DAL_RCM_GPIOC_IS_CLK_ENABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_PCEN)) != RESET)
#define __DAL_RCM_GPIOD_IS_CLK_ENABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_PDEN)) != RESET)
#define __DAL_RCM_ADC2_IS_CLK_ENABLED()    ((RCM->APB2CLKEN & (RCM_APB2CLKEN_ADC2EN)) != RESET)
#define __DAL_RCM_TMR8_IS_CLK_ENABLED()    ((RCM->APB2CLKEN & (RCM_APB2CLKEN_TMR8EN)) != RESET)

#define __DAL_RCM_AFIO_IS_CLK_DISABLED()    ((RCM->APB2CLKEN & (RCM_APB2CLKEN_AFIOEN)) == RESET)
#define __DAL_RCM_GPIOA_IS_CLK_DISABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_PAEN)) == RESET)
#define __DAL_RCM_GPIOB_IS_CLK_DISABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_PBEN)) == RESET)
#define __DAL_RCM_GPIOC_IS_CLK_DISABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_PCEN)) == RESET)
#define __DAL_RCM_GPIOD_IS_CLK_DISABLED()   ((RCM->APB2CLKEN & (RCM_APB2CLKEN_PDEN)) == RESET)
#define __DAL_RCM_ADC2_IS_CLK_DISABLED()    ((RCM->APB2CLKEN & (RCM_APB2CLKEN_ADC2EN)) == RESET)
#define __DAL_RCM_TMR8_IS_CLK_DISABLED()    ((RCM->APB2CLKEN & (RCM_APB2CLKEN_TMR8EN)) == RESET)
/**
  * @}
  */

/** @defgroup RCMEx_AHB1_Force_Release_Reset AHB1 Force Release Reset
  * @brief  Force or release AHB1 peripheral reset.
  * @{
  */
#define __DAL_RCM_USB_OTG_FS_FORCE_RESET()   (RCM->AHB1RST |= (RCM_AHB1RST_OTGFSRST))
#define __DAL_RCM_USB_OTG_FS_RELEASE_RESET()  (RCM->AHB1RST &= ~(RCM_AHB1RST_OTGFSRST))
/**
  * @}
  */

