betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm_ex.h
/** @defgroup RCMEx_APB1_Force_Release_Reset APB1 Force Release Reset
  * @brief  Force or release APB1 peripheral reset.
  * @{
  */
#define __DAL_RCM_TMR2_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_TMR2RST))
#define __DAL_RCM_TMR3_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_TMR3RST))
#define __DAL_RCM_TMR4_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_TMR4RST))
#define __DAL_RCM_USART3_FORCE_RESET()   (RCM->APB1RST |= (RCM_APB1RST_USART3RST))
#define __DAL_RCM_UART4_FORCE_RESET()    (RCM->APB1RST |= (RCM_APB1RST_UART4RST))
#define __DAL_RCM_CAN1_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_CAN1RST))
#define __DAL_RCM_CAN2_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_CAN2RST))
#define __DAL_RCM_BAKP_FORCE_RESET()     (RCM->APB1RST |= (RCM_APB1RST_BAKPRST))

#define __DAL_RCM_TMR2_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_TMR2RST))
#define __DAL_RCM_TMR3_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_TMR3RST))
#define __DAL_RCM_TMR4_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_TMR4RST))
#define __DAL_RCM_USART3_RELEASE_RESET() (RCM->APB1RST &= ~(RCM_APB1RST_USART3RST))
#define __DAL_RCM_UART4_RELEASE_RESET()  (RCM->APB1RST &= ~(RCM_APB1RST_UART4RST))
#define __DAL_RCM_CAN1_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_CAN1RST))
#define __DAL_RCM_CAN2_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_CAN2RST))
#define __DAL_RCM_BAKP_RELEASE_RESET()   (RCM->APB1RST &= ~(RCM_APB1RST_BAKPRST))
/**
  * @}
  */

/** @defgroup RCMEx_APB2_Force_Release_Reset APB2 Force Release Reset
  * @brief  Force or release APB2 peripheral reset.
  * @{
  */
#define __DAL_RCM_AFIO_FORCE_RESET()     (RCM->APB2RST |= (RCM_APB2RST_AFIORST))
#define __DAL_RCM_GPIOA_FORCE_RESET()     (RCM->APB2RST |= (RCM_APB2RST_PARST))
#define __DAL_RCM_GPIOB_FORCE_RESET()     (RCM->APB2RST |= (RCM_APB2RST_PBRST))
#define __DAL_RCM_GPIOC_FORCE_RESET()    (RCM->APB2RST |= (RCM_APB2RST_PCRST))
#define __DAL_RCM_GPIOD_FORCE_RESET()     (RCM->APB2RST |= (RCM_APB2RST_PDRST))
#define __DAL_RCM_ADC1_FORCE_RESET()     (RCM->APB2RST |= (RCM_APB2RST_ADC1RST))
#define __DAL_RCM_ADC2_FORCE_RESET()     (RCM->APB2RST |= (RCM_APB2RST_ADC2RST))
#define __DAL_RCM_TMR8_FORCE_RESET()     (RCM->APB2RST |= (RCM_APB2RST_TMR8RST))

#define __DAL_RCM_AFIO_RELEASE_RESET()   (RCM->APB2RST &= ~(RCM_APB2RST_AFIORST))
#define __DAL_RCM_GPIOA_RELEASE_RESET()   (RCM->APB2RST &= ~(RCM_APB2RST_PARST))
#define __DAL_RCM_GPIOB_RELEASE_RESET()  (RCM->APB2RST &= ~(RCM_APB2RST_PBRST))
#define __DAL_RCM_GPIOC_RELEASE_RESET()   (RCM->APB2RST &= ~(RCM_APB2RST_PCRST))
#define __DAL_RCM_GPIOD_RELEASE_RESET()   (RCM->APB2RST &= ~(RCM_APB2RST_PDRST))
#define __DAL_RCM_ADC1_RELEASE_RESET()   (RCM->APB2RST &= ~(RCM_APB2RST_ADC1RST))
#define __DAL_RCM_ADC2_RELEASE_RESET()   (RCM->APB2RST &= ~(RCM_APB2RST_ADC2RST))
#define __DAL_RCM_TMR8_RELEASE_RESET()   (RCM->APB2RST &= ~(RCM_APB2RST_TMR8RST))
/**
  * @}
  */

#endif /* APM32F403xx || APM32F402xx */
/*----------------------------------------------------------------------------*/
#if defined(APM32F403xx) || defined(APM32F402xx)
/*------------------------------- HSE Configuration --------------------------*/
/** @defgroup RCMEx_HSE_Configuration HSE Configuration
  * @{
  */

/**
  * @brief  Macro to configure the External High Speed oscillator (HSE) Predivision factor for PLL.
  * @note   Predivision factor can not be changed if PLL is used as system clock
  *         In this case, you have to select another source of the system clock, disable the PLL and
  *         then change the HSE predivision factor.
  * @param  __HSE_PREDIV_VALUE__ specifies the division value applied to HSE.
  *         This parameter must be a number between RCM_HSE_PREDIV_DIV1 and RCC_HSE_PREDIV_DIV2.
  */
#define __DAL_RCM_HSE_PREDIV_CONFIG(__HSE_PREDIV_VALUE__) \
                  MODIFY_REG(RCM->CFG,RCM_CFG_PLLHSEPSC, (uint32_t)(__HSE_PREDIV_VALUE__))

/**
  * @brief  Macro to get prediv1 factor for PLL.
  */
#define __DAL_RCM_HSE_GET_PREDIV() READ_BIT(RCM->CFG, RCM_CFG_PLLHSEPSC)

/**
  * @}
  */
#endif /* APM32F403xx || APM32F402xx */
/*------------------------------- PLL Configuration --------------------------*/
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
/** @brief  Macro to configure the main PLL clock source, multiplication and division factors.
  * @note   This function must be used only when the main PLL is disabled.
  * @param  __RCM_PLLSource__ specifies the PLL entry clock source.
  *         This parameter can be one of the following values:
  *            @arg RCM_PLLSOURCE_HSI: HSI oscillator clock selected as PLL clock entry
  *            @arg RCM_PLLSOURCE_HSE: HSE oscillator clock selected as PLL clock entry
  * @note   This clock source (RCM_PLLSource) is common for the main PLL and PLLI2S.
  * @param  __PLLB__ specifies the division factor for PLL VCO input clock
  *         This parameter must be a number between Min_Data = 2 and Max_Data = 63.
  * @note   You have to set the PLLB parameter correctly to ensure that the VCO input
  *         frequency ranges from 1 to 2 MHz. It is recommended to select a frequency
  *         of 2 MHz to limit PLL jitter.
  * @param  __PLL1A__ specifies the multiplication factor for PLL VCO output clock
  *         This parameter must be a number between Min_Data = 50 and Max_Data = 432
  *         Except for APM32F411xx devices where Min_Data = 192.
  * @note   You have to set the PLL1A parameter correctly to ensure that the VCO
  *         output frequency is between 100 and 432 MHz, Except for APM32F411xx devices
  *         where frequency is between 192 and 432 MHz.
  * @param  __PLL1C__ specifies the division factor for main system clock (SYSCLK)
  *         This parameter must be a number in the range {2, 4, 6, or 8}.
  *
  * @param  __PLLD__ specifies the division factor for OTG FS, SDIO and RNG clocks
  *         This parameter must be a number between Min_Data = 2 and Max_Data = 15.
  * @note   If the USB OTG FS is used in your application, you have to set the
  *         PLLD parameter correctly to have 48 MHz clock for the USB. However,
  *         the SDIO and RNG need a frequency lower than or equal to 48 MHz to work
  *         correctly.
  *
  */
#define __DAL_RCM_PLL_CONFIG(__RCM_PLLSource__, __PLLB__, __PLL1A__, __PLL1C__, __PLLD__)     \
                            (RCM->PLL1CFG = (0x20000000U | (__RCM_PLLSource__) | (__PLLB__)| \
                            ((__PLL1A__) << RCM_PLL1CFG_PLL1A_Pos)                | \
                            ((((__PLL1C__) >> 1U) -1U) << RCM_PLL1CFG_PLL1C_Pos)    | \
                            ((__PLLD__) << RCM_PLL1CFG_PLLD_Pos)))
#else
/** @brief  Macro to configure the main PLL clock source and multiplication factors.
  * @note   This function must be used only when the main PLL is disabled.
  *
  * @param  __RCC_PLLSOURCE__ specifies the PLL entry clock source.
  *          This parameter can be one of the following values:
  *            @arg @ref RCM_PLLSOURCE_HSI_DIV2 HSI oscillator clock selected as PLL clock entry
  *            @arg @ref RCM_PLLSOURCE_HSE HSE oscillator clock selected as PLL clock entry
  * @param  __PLLMUL__ specifies the multiplication factor for PLL VCO output clock
  *          This parameter can be one of the following values:
  *             @arg @ref RCM_PLL_MUL2    PLLVCO = PLL clock entry x 2
  *             @arg @ref RCM_PLL_MUL3    PLLVCO = PLL clock entry x 3
  *             @arg @ref RCM_PLL_MUL4    PLLVCO = PLL clock entry x 4
  *             @arg @ref RCM_PLL_MUL5    PLLVCO = PLL clock entry x 5
  *             @arg @ref RCM_PLL_MUL6    PLLVCO = PLL clock entry x 6
  *             @arg @ref RCM_PLL_MUL7    PLLVCO = PLL clock entry x 7
  *             @arg @ref RCM_PLL_MUL8    PLLVCO = PLL clock entry x 8
  *             @arg @ref RCM_PLL_MUL9    PLLVCO = PLL clock entry x 9
  *             @arg @ref RCM_PLL_MUL10   PLLVCO = PLL clock entry x 10
  *             @arg @ref RCM_PLL_MUL11   PLLVCO = PLL clock entry x 11
  *             @arg @ref RCM_PLL_MUL12   PLLVCO = PLL clock entry x 12
  *             @arg @ref RCM_PLL_MUL13   PLLVCO = PLL clock entry x 13
  *             @arg @ref RCM_PLL_MUL14   PLLVCO = PLL clock entry x 14
  *             @arg @ref RCM_PLL_MUL15   PLLVCO = PLL clock entry x 15
  *             @arg @ref RCM_PLL_MUL16   PLLVCO = PLL clock entry x 16
  *
  */
#define __DAL_RCM_PLL_CONFIG(__RCM_PLLSOURCE__, __PLLMUL__)\
          MODIFY_REG(RCM->CFG, (RCM_CFG_PLLSRCSEL | RCM_CFG_PLLMULCFG),((__RCM_PLLSOURCE__) | (__PLLMUL__) ))

/** @brief  Get oscillator clock selected as PLL input clock
  * @retval The clock source used for PLL entry. The returned value can be one
  *         of the following:
  *             @arg @ref RCM_PLLSOURCE_HSI_DIV2 HSI oscillator clock selected as PLL input clock
  *             @arg @ref RCM_PLLSOURCE_HSE HSE oscillator clock selected as PLL input clock
  */
#define __DAL_RCM_GET_PLL_OSCSOURCE() ((uint32_t)(READ_BIT(RCM->CFG, RCM_CFG_PLLSRCSEL)))

