betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm_ex.h
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
/*----------------------------------------------------------------------------*/

/*----------------------------PLLI2S Configuration ---------------------------*/
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || \
    defined(APM32F465xx) || defined(APM32F411xx)

/** @brief Macros to enable or disable the PLLI2S.
  * @note  The PLLI2S is disabled by hardware when entering STOP and STANDBY modes.
  */
#define __DAL_RCM_PLLI2S_ENABLE() (*(__IO uint32_t *) RCM_CTRL_PLL2EN_BB = ENABLE)
#define __DAL_RCM_PLLI2S_DISABLE() (*(__IO uint32_t *) RCM_CTRL_PLL2EN_BB = DISABLE)

/** @brief  Macro to configure the PLLI2S clock multiplication and division factors .
  * @note   This macro must be used only when the PLLI2S is disabled.
  * @note   PLLI2S clock source is common with the main PLL (configured in
  *         DAL_RCM_ClockConfig() API).
  * @param  __PLL2A__ specifies the multiplication factor for PLLI2S VCO output clock
  *         This parameter must be a number between Min_Data = 50 and Max_Data = 432.
  * @note   You have to set the PLL2A parameter correctly to ensure that the VCO
  *         output frequency is between Min_Data = 100 and Max_Data = 432 MHz.
  *
  * @param  __PLL2C__ specifies the division factor for I2S clock
  *         This parameter must be a number between Min_Data = 2 and Max_Data = 7.
  * @note   You have to set the PLL2C parameter correctly to not exceed 192 MHz
  *         on the I2S clock frequency.
  *
  */
#define __DAL_RCM_PLLI2S_CONFIG(__PLL2A__, __PLL2C__)                                                    \
                               (RCM->PLL2CFG = (((__PLL2A__) << RCM_PLL2CFG_PLL2A_Pos)  |\
                               ((__PLL2C__) << RCM_PLL2CFG_PLL2C_Pos)))
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F411xx */

#if defined(APM32F411xx)
/** @brief  Macro to configure the PLLI2S clock multiplication and division factors .
  * @note   This macro must be used only when the PLLI2S is disabled.
  * @note   This macro must be used only when the PLLI2S is disabled.
  * @note   PLLI2S clock source is common with the main PLL (configured in
  *         DAL_RCM_ClockConfig() API).
  * @param  __PLL2B__ specifies the division factor for PLLI2S VCO input clock
  *         This parameter must be a number between Min_Data = 2 and Max_Data = 63.
  * @note   The PLL2B parameter is only used with APM32F411xx Devices
  * @note   You have to set the PLL2B parameter correctly to ensure that the VCO input
  *         frequency ranges from 1 to 2 MHz. It is recommended to select a frequency
  *         of 2 MHz to limit PLLI2S jitter.
  * @param  __PLL2A__ specifies the multiplication factor for PLLI2S VCO output clock
  *         This parameter must be a number between Min_Data = 192 and Max_Data = 432.
  * @note   You have to set the PLL2A parameter correctly to ensure that the VCO
  *         output frequency is between Min_Data = 192 and Max_Data = 432 MHz.
  * @param  __PLL2C__ specifies the division factor for I2S clock
  *         This parameter must be a number between Min_Data = 2 and Max_Data = 7.
  * @note   You have to set the PLL2C parameter correctly to not exceed 192 MHz
  *         on the I2S clock frequency.
  */
#define __DAL_RCM_PLLI2S_I2SCLK_CONFIG(__PLL2B__, __PLL2A__, __PLL2C__) (RCM->PLL2CFG = ((__PLL2B__)                                                       |\
                                                                                                  ((__PLL2A__) << RCM_PLL2CFG_PLL2A_Pos)             |\
                                                                                                  ((__PLL2C__) << RCM_PLL2CFG_PLL2C_Pos)))
#endif /* APM32F411xx */

/*------------------------- Peripheral Clock selection -----------------------*/
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) ||\
    defined(APM32F465xx) || defined(APM32F411xx)
/** @brief  Macro to configure the I2S clock source (I2SCLK).
  * @note   This function must be called before enabling the I2S APB clock.
  * @param  __SOURCE__ specifies the I2S clock source.
  *         This parameter can be one of the following values:
  *            @arg RCM_I2SCLKSOURCE_PLLI2S: PLLI2S clock used as I2S clock source.
  *            @arg RCM_I2SCLKSOURCE_EXT: External clock mapped on the I2S_CKIN pin
  *                                       used as I2S clock source.
  */
#define __DAL_RCM_I2S_CONFIG(__SOURCE__) (*(__IO uint32_t *) RCM_CFG_I2SSEL_BB = (__SOURCE__))


/** @brief  Macro to get the I2S clock source (I2SCLK).
  * @retval The clock source can be one of the following values:
  *            @arg @ref RCM_I2SCLKSOURCE_PLLI2S: PLLI2S clock used as I2S clock source.
  *            @arg @ref RCM_I2SCLKSOURCE_EXT External clock mapped on the I2S_CKIN pin
  *                                        used as I2S clock source
  */
#define __DAL_RCM_GET_I2S_SOURCE() ((uint32_t)(READ_BIT(RCM->CFG, RCM_CFG_I2SSEL)))
#endif /* APM32F40xxx || APM32F41xxx || APM32F465xx */

#if defined(APM32F411xx)
/** @brief  Macro to configure the Timers clocks prescalers
  * @note   This feature is only available with APM32F429x/439x Devices.
  * @param  __PRESC__  specifies the Timers clocks prescalers selection
  *         This parameter can be one of the following values:
  *            @arg RCM_TMRPRES_DESACTIVATED: The Timers kernels clocks prescaler is
  *                 equal to HPRE if PPREx is corresponding to division by 1 or 2,
  *                 else it is equal to [(HPRE * PPREx) / 2] if PPREx is corresponding to
  *                 division by 4 or more.
  *            @arg RCM_TMRPRES_ACTIVATED: The Timers kernels clocks prescaler is
  *                 equal to HPRE if PPREx is corresponding to division by 1, 2 or 4,
  *                 else it is equal to [(HPRE * PPREx) / 4] if PPREx is corresponding
  *                 to division by 8 or more.
  */
#define __DAL_RCM_TMRCLKPRESCALER(__PRESC__) (*(__IO uint32_t *) RCM_CFGSEL_CLKPSEL_BB = (__PRESC__))

#endif /* APM32F411xx */

#if defined(APM32F403xx) || defined(APM32F402xx)
/** @defgroup RCCEx_Peripheral_Configuration Peripheral Configuration
  * @brief  Macros to configure clock source of different peripherals.
  * @{
  */
/** @brief  Macro to configure the USB clock.
  * @param  __USBCLKSOURCE__ specifies the USB clock source.
  *          This parameter can be one of the following values:
  *            @arg @ref RCM_USBCLKSOURCE_PLL         PLL clock divided by 1 selected as USB clock
  *            @arg @ref RCM_USBCLKSOURCE_PLL_DIV1_5  PLL clock divided by 1.5 selected as USB clock
  *            @arg @ref RCM_USBCLKSOURCE_PLL_DIV2    PLL clock divided by 2 selected as USB clock
  *            @arg @ref RCM_USBCLKSOURCE_PLL_DIV2_5  PLL clock divided by 2.5 selected as USB clock
  */
#define __DAL_RCM_USB_CONFIG(__USBCLKSOURCE__) \
                  MODIFY_REG(RCM->CFG, RCM_CFG_OTGFSPSC, (uint32_t)(__USBCLKSOURCE__))

/** @brief  Macro to get the USB clock (USBCLK).
  * @retval The clock source can be one of the following values:
  *            @arg @ref RCM_USBCLKSOURCE_PLL         PLL clock divided by 1 selected as USB clock
  *            @arg @ref RCM_USBCLKSOURCE_PLL_DIV1_5  PLL clock divided by 1.5 selected as USB clock
  *            @arg @ref RCM_USBCLKSOURCE_PLL_DIV2    PLL clock divided by 2 selected as USB clock
  *            @arg @ref RCM_USBCLKSOURCE_PLL_DIV2_5  PLL clock divided by 2.5 selected as USB clock
  */
#define __DAL_RCM_GET_USB_SOURCE() ((uint32_t)(READ_BIT(RCM->CFG, RCM_CFG_OTGFSPSC)))

/** @brief  Macro to configure the ADCx clock (x=1 to 3 depending on devices).
  * @param  __ADCCLKSOURCE__ specifies the ADC clock source.
  *          This parameter can be one of the following values:
  *            @arg @ref RCM_ADCPCLK2_DIV2 PCLK2 clock divided by 2 selected as ADC clock
  *            @arg @ref RCM_ADCPCLK2_DIV4 PCLK2 clock divided by 4 selected as ADC clock
  *            @arg @ref RCM_ADCPCLK2_DIV6 PCLK2 clock divided by 6 selected as ADC clock
  *            @arg @ref RCM_ADCPCLK2_DIV8 PCLK2 clock divided by 8 selected as ADC clock
  */
#define __DAL_RCM_ADC_CONFIG(__ADCCLKSOURCE__) \
                  MODIFY_REG(RCM->CFG, RCM_CFG_ADCPSC, (uint32_t)(__ADCCLKSOURCE__))

/** @brief  Macro to get the ADC clock (ADCxCLK, x=1 to 2 depending on devices).
  * @retval The clock source can be one of the following values:
  *            @arg @ref RCM_ADCPCLK2_DIV2 PCLK2 clock divided by 2 selected as ADC clock
  *            @arg @ref RCM_ADCPCLK2_DIV4 PCLK2 clock divided by 4 selected as ADC clock
  *            @arg @ref RCM_ADCPCLK2_DIV6 PCLK2 clock divided by 6 selected as ADC clock
  *            @arg @ref RCM_ADCPCLK2_DIV8 PCLK2 clock divided by 8 selected as ADC clock
  */
#define __DAL_RCM_GET_ADC_SOURCE() ((uint32_t)(READ_BIT(RCM->CFG, RCM_CFG_ADCPSC)))
/**
  * @}
  */
#endif /* APM32F403xx || APM32F402xx */

