betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_rcm_ex.h
/*----------------------------------------------------------------------------*/

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup RCMEx_Exported_Functions
  *  @{
  */

/** @addtogroup RCMEx_Exported_Functions_Group1
  *  @{
  */
DAL_StatusTypeDef DAL_RCMEx_PeriphCLKConfig(RCM_PeriphCLKInitTypeDef  *PeriphClkInit);
void DAL_RCMEx_GetPeriphCLKConfig(RCM_PeriphCLKInitTypeDef  *PeriphClkInit);

uint32_t DAL_RCMEx_GetPeriphCLKFreq(uint32_t PeriphClk);

#if defined(APM32F411xx) && defined(RCM_BDCTRL_LSEMOD)
void DAL_RCMEx_SelectLSEMode(uint8_t Mode);
#endif /* APM32F411xx */
#if defined(RCM_PLLI2S_SUPPORT)
DAL_StatusTypeDef DAL_RCMEx_EnablePLLI2S(RCM_PLLI2SInitTypeDef  *PLLI2SInit);
DAL_StatusTypeDef DAL_RCMEx_DisablePLLI2S(void);
#endif /* RCM_PLLI2S_SUPPORT */
/**
  * @}
  */

/**
  * @}
  */
/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup RCMEx_Private_Constants RCMEx Private Constants
  * @{
  */

/** @defgroup RCMEx_BitAddress_AliasRegion RCM BitAddress AliasRegion
  * @brief RCM registers bit address in the alias region
  * @{
  */
/* --- CTRL Register ---*/

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || \
    defined(APM32F465xx) || defined(APM32F411xx)
/* Alias word address of PLL2EN bit */
#define RCM_PLL2EN_BIT_NUMBER       0x1AU
#define RCM_CTRL_PLL2EN_BB          (PERIPH_BB_BASE + (RCM_CTRL_OFFSET * 32U) + (RCM_PLL2EN_BIT_NUMBER * 4U))
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F411xx */

/* --- DCKCFGR Register ---*/
#if defined(APM32F411xx)
/* Alias word address of TMRPRE bit */
#define RCM_CFGSEL_OFFSET           (RCM_OFFSET + 0x8CU)
#define RCM_CLKPSEL_BIT_NUMBER      0x18U
#define RCM_CFGSEL_CLKPSEL_BB       (PERIPH_BB_BASE + (RCM_CFGSEL_OFFSET * 32U) + (RCM_CLKPSEL_BIT_NUMBER * 4U))
#endif /* APM32F411xx */

/* --- CFG Register ---*/
#define RCM_CFG_OFFSET              (RCM_OFFSET + 0x08U)
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || \
    defined(APM32F465xx) || defined(APM32F411xx)
/* Alias word address of I2SSRC bit */
#define RCM_I2SSEL_BIT_NUMBER       0x17U
#define RCM_CFG_I2SSEL_BB           (PERIPH_BB_BASE + (RCM_CFG_OFFSET * 32U) + (RCM_I2SSEL_BIT_NUMBER * 4U))

#define PLLI2S_TIMEOUT_VALUE       2U  /* Timeout value fixed to 2 ms  */
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F411xx */

#define PLL_TIMEOUT_VALUE          2U  /* 2 ms */
/**
  * @}
  */

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup RCMEx_Private_Macros RCMEx Private Macros
  * @{
  */
/** @defgroup RCMEx_IS_RCM_Definitions RCM Private macros to check input parameters
  * @{
  */
#if defined(APM32F407xx) || defined(APM32F417xx) || defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define IS_RCM_SDRAM_DIV(DIV)           (((DIV) == RCM_SDRAM_DIV_1) ||\
                                         ((DIV) == RCM_SDRAM_DIV_2) ||\
                                         ((DIV) == RCM_SDRAM_DIV_4))
#endif /* APM32F407xx || APM32F417xx || APM32F423xx || APM32F425xx || APM32F427xx */

#define IS_RCM_PLL1A_VALUE(VALUE) ((50U <= (VALUE)) && ((VALUE) <= 432U))
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F411xx)
#define IS_RCM_PLL2A_VALUE(VALUE) ((50U <= (VALUE)) && ((VALUE) <= 432U))
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F411xx */

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F417xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
#define IS_RCM_PERIPHCLOCK(SELECTION) ((1U <= (SELECTION)) && ((SELECTION) <= 0x0000000FU))
#endif /* APM32F405xx || APM32F407xx || APM32F417xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

#if defined(APM32F411xx)
#define IS_RCM_PERIPHCLOCK(SELECTION) ((1U <= (SELECTION)) && ((SELECTION) <= 0x0000000FU))
#endif /* APM32F411xx */

#if defined(APM32F402xx) || defined(APM32F403xx)
#define IS_RCM_PERIPHCLOCK(SELECTION) ((1U <= (SELECTION)) && ((SELECTION) <= 0x0000000FU))
#endif /* APM32F402xx || APM32F403xx */

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || \
    defined(APM32F465xx) || defined(APM32F411xx)
#define IS_RCM_PLL2C_VALUE(VALUE) ((2U <= (VALUE)) && ((VALUE) <= 7U))
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F411xx */

#if defined(APM32F411xx)
#define IS_RCM_PLL2B_VALUE(VALUE)   ((2U <= (VALUE)) && ((VALUE) <= 63U))
#if defined(RCM_BDCTRL_LSEMOD)
#define IS_RCM_LSE_MODE(MODE)           (((MODE) == RCM_LSE_LOWPOWER_MODE) ||\
                                         ((MODE) == RCM_LSE_HIGHDRIVE_MODE))
#endif /* RCM_BDCTRL_LSEMOD */
#endif /* APM32F411xx */

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || \
    defined(APM32F465xx) || defined(APM32F411xx)

#define IS_RCM_MCO2SOURCE(SOURCE) (((SOURCE) == RCM_MCO2SOURCE_SYSCLK) || ((SOURCE) == RCM_MCO2SOURCE_PLLI2SCLK)|| \
                                   ((SOURCE) == RCM_MCO2SOURCE_HSE)    || ((SOURCE) == RCM_MCO2SOURCE_PLLCLK))

#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F465xx || APM32F411xx */

#if defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)

#define IS_RCM_MCO2SOURCE(SOURCE) (((SOURCE) == RCM_MCO2SOURCE_SYSCLK) || ((SOURCE) == RCM_MCO2SOURCE_HSE) || \
                                   ((SOURCE) == RCM_MCO2SOURCE_PLLCLK))

#endif /* APM32F423xx || APM32F425xx || APM32F427xx */

#if defined(APM32F403xx) || defined(APM32F402xx)
#define IS_RCM_ADCPLLCLK_DIV(__ADCCLK__) (((__ADCCLK__) == RCM_ADCPCLK2_DIV2)  || ((__ADCCLK__) == RCM_ADCPCLK2_DIV4)   || \
                                          ((__ADCCLK__) == RCM_ADCPCLK2_DIV6)  || ((__ADCCLK__) == RCM_ADCPCLK2_DIV8))

#define IS_RCM_USBPLLCLK_DIV(__USBCLK__) (((__USBCLK__) == RCM_USBCLKSOURCE_PLL)  || ((__USBCLK__) == RCM_USBCLKSOURCE_PLL_DIV1_5) ||\
                                          ((__USBCLK__) == RCM_USBCLKSOURCE_PLL_DIV2)  || ((__USBCLK__) == RCM_USBCLKSOURCE_PLL_DIV2_5))

#define IS_RCM_HSE_PREDIV(__DIV__) (((__DIV__) == RCM_HSE_PREDIV_DIV1)  || ((__DIV__) == RCM_HSE_PREDIV_DIV2))
#endif /* APM32F403xx || APM32F402xx */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#ifdef __cplusplus
}
#endif

#endif /* APM32F4xx_DAL_RCM_EX_H */

